apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_xbar.h
/****************************************************************************
 * arch/arm/src/imxrt/hardware/rt118x/imxrt118x_xbar.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_RT118X_IMXRT118X_XBAR_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_RT118X_IMXRT118X_XBAR_H

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Inter-Peripheral Crossbar Switch (XBAR) for i.MX RT1180 (IMXRT1180RM
 * Ch. 78).  Three instances are present:
 *
 *   XBAR1  base 0x4275_0000  216 inputs, 221 outputs (SEL0..SEL110)
 *   XBAR2  base 0x4276_0000  178 inputs,  32 outputs (SEL0..SEL15)
 *   XBAR3  base 0x4277_0000  178 inputs,  32 outputs (SEL0..SEL15)
 *
 * All three instances use full 8-bit select fields.
 */

#define IMXRT_XBAR_SEL_MASKS  {0xff, 0xff, 0xff}

/* IMXRT_XBARn_BASE constants live in the RT1180 memory map
 * (hardware/rt118x/imxrt118x_memorymap.h).
 */

/****************************************************************************
 * XBAR Input Assignments (IMXRT1180RM Table 14)
 ****************************************************************************/

#define IMXRT_XBAR1_IN_GND                                                      IMXRT_XBAR1(XBAR_INPUT, 0)      /* XBAR1_IN0 <- -  GND */
#define IMXRT_XBAR1_IN_1B1                                                      IMXRT_XBAR1(XBAR_INPUT, 1)      /* XBAR1_IN1 <- -  1'B1 */
#define IMXRT_XBAR1_IN_GND_2                                                    IMXRT_XBAR1(XBAR_INPUT, 2)      /* XBAR1_IN2 <- -  GND */
#define IMXRT_XBAR1_IN_1B1_2                                                    IMXRT_XBAR1(XBAR_INPUT, 3)      /* XBAR1_IN3 <- -  1'B1 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT04                                       IMXRT_XBAR1(XBAR_INPUT, 4)      /* XBAR1_IN4 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 00[MUX_MODE] = 0x1 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT05                                       IMXRT_XBAR1(XBAR_INPUT, 5)      /* XBAR1_IN5 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 01[MUX_MODE] = 0x1 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT06                                       IMXRT_XBAR1(XBAR_INPUT, 6)      /* XBAR1_IN6 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 02[MUX_MODE] = 0x1 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT07                                       IMXRT_XBAR1(XBAR_INPUT, 7)      /* XBAR1_IN7 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 03[MUX_MODE] = 0x1 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT08                                       IMXRT_XBAR1(XBAR_INPUT, 8)      /* XBAR1_IN8 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 04[MUX_MODE] = 0x1 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT09                                       IMXRT_XBAR1(XBAR_INPUT, 9)      /* XBAR1_IN9 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 05[MUX_MODE] = 0x1 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT10                                       IMXRT_XBAR1(XBAR_INPUT, 10)     /* XBAR1_IN10 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 26[MUX_MODE] = 0x2 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT11                                       IMXRT_XBAR1(XBAR_INPUT, 11)     /* XBAR1_IN11 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 27[MUX_MODE] = 0x2 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT12                                       IMXRT_XBAR1(XBAR_INPUT, 12)     /* XBAR1_IN12 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 28[MUX_MODE] = 0x2 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT13                                       IMXRT_XBAR1(XBAR_INPUT, 13)     /* XBAR1_IN13 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 29[MUX_MODE] = 0x2 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT14                                       IMXRT_XBAR1(XBAR_INPUT, 14)     /* XBAR1_IN14 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 16[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT15                                       IMXRT_XBAR1(XBAR_INPUT, 15)     /* XBAR1_IN15 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 17[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT16                                       IMXRT_XBAR1(XBAR_INPUT, 16)     /* XBAR1_IN16 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 18[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT17                                       IMXRT_XBAR1(XBAR_INPUT, 17)     /* XBAR1_IN17 <- -  SW_MUX_CTL_PAD_GPIO_AD_33[MU See IOMUX Controller X_MODE] = */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT18                                       IMXRT_XBAR1(XBAR_INPUT, 18)     /* XBAR1_IN18 <- -  SW_MUX_CTL_PAD_GPIO_AD_12[MU See IOMUX Controller X_MODE] = */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT19                                       IMXRT_XBAR1(XBAR_INPUT, 19)     /* XBAR1_IN19 <- -  SW_MUX_CTL_PAD_GPIO_AD_19[MU See IOMUX Controller X_MODE] = */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT20                                       IMXRT_XBAR1(XBAR_INPUT, 20)     /* XBAR1_IN20 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 00[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT21                                       IMXRT_XBAR1(XBAR_INPUT, 21)     /* XBAR1_IN21 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 01[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT22                                       IMXRT_XBAR1(XBAR_INPUT, 22)     /* XBAR1_IN22 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 02[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT23                                       IMXRT_XBAR1(XBAR_INPUT, 23)     /* XBAR1_IN23 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 03[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT24                                       IMXRT_XBAR1(XBAR_INPUT, 24)     /* XBAR1_IN24 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 04[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT25                                       IMXRT_XBAR1(XBAR_INPUT, 25)     /* XBAR1_IN25 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 05[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT26                                       IMXRT_XBAR1(XBAR_INPUT, 26)     /* XBAR1_IN26 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 06[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT27                                       IMXRT_XBAR1(XBAR_INPUT, 27)     /* XBAR1_IN27 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 07[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT28                                       IMXRT_XBAR1(XBAR_INPUT, 28)     /* XBAR1_IN28 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 08[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT29                                       IMXRT_XBAR1(XBAR_INPUT, 29)     /* XBAR1_IN29 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 09[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT30                                       IMXRT_XBAR1(XBAR_INPUT, 30)     /* XBAR1_IN30 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 10[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT31                                       IMXRT_XBAR1(XBAR_INPUT, 31)     /* XBAR1_IN31 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 11[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT32                                       IMXRT_XBAR1(XBAR_INPUT, 32)     /* XBAR1_IN32 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 12[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT33                                       IMXRT_XBAR1(XBAR_INPUT, 33)     /* XBAR1_IN33 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 13[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT34                                       IMXRT_XBAR1(XBAR_INPUT, 34)     /* XBAR1_IN34 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 14[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT35                                       IMXRT_XBAR1(XBAR_INPUT, 35)     /* XBAR1_IN35 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 15[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT36                                       IMXRT_XBAR1(XBAR_INPUT, 36)     /* XBAR1_IN36 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 19[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_IOMUX_XBAR_INOUT37                                       IMXRT_XBAR1(XBAR_INPUT, 37)     /* XBAR1_IN37 <- -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 20[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_IN_CMP1_COUT                                                IMXRT_XBAR1(XBAR_INPUT, 38)     /* XBAR1_IN38 <- CMP1  COUT */
#define IMXRT_XBAR1_IN_CMP2_COUT                                                IMXRT_XBAR1(XBAR_INPUT, 39)     /* XBAR1_IN39 <- CMP2  COUT */
#define IMXRT_XBAR1_IN_CMP3_COUT                                                IMXRT_XBAR1(XBAR_INPUT, 40)     /* XBAR1_IN40 <- CMP3  COUT */
#define IMXRT_XBAR1_IN_CMP4_COUT                                                IMXRT_XBAR1(XBAR_INPUT, 41)     /* XBAR1_IN41 <- CMP4  COUT */
#define IMXRT_XBAR1_IN_TMR1_TMR0_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 42)     /* XBAR1_IN42 <- TMR1  TMR0_OUTPUT */
#define IMXRT_XBAR1_IN_TMR1_TMR1_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 43)     /* XBAR1_IN43 <- TMR1  TMR1_OUTPUT */
#define IMXRT_XBAR1_IN_TMR1_TMR2_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 44)     /* XBAR1_IN44 <- TMR1  TMR2_OUTPUT */
#define IMXRT_XBAR1_IN_TMR1_TMR3_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 45)     /* XBAR1_IN45 <- TMR1  TMR3_OUTPUT */
#define IMXRT_XBAR1_IN_TMR2_TMR0_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 46)     /* XBAR1_IN46 <- TMR2  TMR0_OUTPUT */
#define IMXRT_XBAR1_IN_TMR2_TMR1_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 47)     /* XBAR1_IN47 <- TMR2  TMR1_OUTPUT */
#define IMXRT_XBAR1_IN_TMR2_TMR2_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 48)     /* XBAR1_IN48 <- TMR2  TMR2_OUTPUT */
#define IMXRT_XBAR1_IN_TMR2_TMR3_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 49)     /* XBAR1_IN49 <- TMR2  TMR3_OUTPUT */
#define IMXRT_XBAR1_IN_TMR3_TMR0_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 50)     /* XBAR1_IN50 <- TMR3  TMR0_OUTPUT */
#define IMXRT_XBAR1_IN_TMR3_TMR1_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 51)     /* XBAR1_IN51 <- TMR3  TMR1_OUTPUT */
#define IMXRT_XBAR1_IN_TMR3_TMR2_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 52)     /* XBAR1_IN52 <- TMR3  TMR2_OUTPUT */
#define IMXRT_XBAR1_IN_TMR3_TMR3_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 53)     /* XBAR1_IN53 <- TMR3  TMR3_OUTPUT */
#define IMXRT_XBAR1_IN_TMR4_TMR0_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 54)     /* XBAR1_IN54 <- TMR4  TMR0_OUTPUT */
#define IMXRT_XBAR1_IN_TMR4_TMR1_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 55)     /* XBAR1_IN55 <- TMR4  TMR1_OUTPUT */
#define IMXRT_XBAR1_IN_TMR4_TMR2_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 56)     /* XBAR1_IN56 <- TMR4  TMR2_OUTPUT */
#define IMXRT_XBAR1_IN_TMR4_TMR3_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 57)     /* XBAR1_IN57 <- TMR4  TMR3_OUTPUT */
#define IMXRT_XBAR1_IN_TMR5_TMR0_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 58)     /* XBAR1_IN58 <- TMR5  TMR0_OUTPUT */
#define IMXRT_XBAR1_IN_TMR5_TMR1_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 59)     /* XBAR1_IN59 <- TMR5  TMR1_OUTPUT */
#define IMXRT_XBAR1_IN_TMR5_TMR2_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 60)     /* XBAR1_IN60 <- TMR5  TMR2_OUTPUT */
#define IMXRT_XBAR1_IN_TMR5_TMR3_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 61)     /* XBAR1_IN61 <- TMR5  TMR3_OUTPUT */
#define IMXRT_XBAR1_IN_TMR6_TMR0_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 62)     /* XBAR1_IN62 <- TMR6  TMR0_OUTPUT */
#define IMXRT_XBAR1_IN_TMR6_TMR1_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 63)     /* XBAR1_IN63 <- TMR6  TMR1_OUTPUT */
#define IMXRT_XBAR1_IN_TMR6_TMR2_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 64)     /* XBAR1_IN64 <- TMR6  TMR2_OUTPUT */
#define IMXRT_XBAR1_IN_TMR6_TMR3_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 65)     /* XBAR1_IN65 <- TMR6  TMR3_OUTPUT */
#define IMXRT_XBAR1_IN_TMR7_TMR0_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 66)     /* XBAR1_IN66 <- TMR7  TMR0_OUTPUT */
#define IMXRT_XBAR1_IN_TMR7_TMR1_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 67)     /* XBAR1_IN67 <- TMR7  TMR1_OUTPUT */
#define IMXRT_XBAR1_IN_TMR7_TMR2_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 68)     /* XBAR1_IN68 <- TMR7  TMR2_OUTPUT */
#define IMXRT_XBAR1_IN_TMR7_TMR3_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 69)     /* XBAR1_IN69 <- TMR7  TMR3_OUTPUT */
#define IMXRT_XBAR1_IN_TMR8_TMR0_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 70)     /* XBAR1_IN70 <- TMR8  TMR0_OUTPUT */
#define IMXRT_XBAR1_IN_TMR8_TMR1_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 71)     /* XBAR1_IN71 <- TMR8  TMR1_OUTPUT */
#define IMXRT_XBAR1_IN_TMR8_TMR2_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 72)     /* XBAR1_IN72 <- TMR8  TMR2_OUTPUT */
#define IMXRT_XBAR1_IN_TMR8_TMR3_OUTPUT                                         IMXRT_XBAR1(XBAR_INPUT, 73)     /* XBAR1_IN73 <- TMR8  TMR3_OUTPUT */
#define IMXRT_XBAR1_IN_FLEXPWM1_PWM0_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 74)     /* XBAR1_IN74 <- FLEXPWM1  PWM0_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM1_PWM0_MUX_TRIGGER1                               IMXRT_XBAR1(XBAR_INPUT, 75)     /* XBAR1_IN75 <- FLEXPWM1  PWM0_MUX_TRIGGER1 */
#define IMXRT_XBAR1_IN_FLEXPWM1_PWM1_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 76)     /* XBAR1_IN76 <- FLEXPWM1  PWM1_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM1_PWM1_MUX_TRIGGER1                               IMXRT_XBAR1(XBAR_INPUT, 77)     /* XBAR1_IN77 <- FLEXPWM1  PWM1_MUX_TRIGGER1 */
#define IMXRT_XBAR1_IN_FLEXPWM1_PWM2_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 78)     /* XBAR1_IN78 <- FLEXPWM1  PWM2_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM1_PWM2_MUX_TRIGGER1                               IMXRT_XBAR1(XBAR_INPUT, 79)     /* XBAR1_IN79 <- FLEXPWM1  PWM2_MUX_TRIGGER1 */
#define IMXRT_XBAR1_IN_FLEXPWM1_PWM3_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 80)     /* XBAR1_IN80 <- FLEXPWM1  PWM3_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM1_PWM3_MUX_TRIGGER1                               IMXRT_XBAR1(XBAR_INPUT, 81)     /* XBAR1_IN81 <- FLEXPWM1  PWM3_MUX_TRIGGER1 */
#define IMXRT_XBAR1_IN_FLEXPWM2_PWM0_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 82)     /* XBAR1_IN82 <- FLEXPWM2  PWM0_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM2_PWM1_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 83)     /* XBAR1_IN83 <- FLEXPWM2  PWM1_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM2_PWM2_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 84)     /* XBAR1_IN84 <- FLEXPWM2  PWM2_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM2_PWM3_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 85)     /* XBAR1_IN85 <- FLEXPWM2  PWM3_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM3_PWM0_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 86)     /* XBAR1_IN86 <- FLEXPWM3  PWM0_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM3_PWM1_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 87)     /* XBAR1_IN87 <- FLEXPWM3  PWM1_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM3_PWM2_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 88)     /* XBAR1_IN88 <- FLEXPWM3  PWM2_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM3_PWM3_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 89)     /* XBAR1_IN89 <- FLEXPWM3  PWM3_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM4_PWM0_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 90)     /* XBAR1_IN90 <- FLEXPWM4  PWM0_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM4_PWM1_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 91)     /* XBAR1_IN91 <- FLEXPWM4  PWM1_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM4_PWM2_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 92)     /* XBAR1_IN92 <- FLEXPWM4  PWM2_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_FLEXPWM4_PWM3_MUX_TRIGGER0                               IMXRT_XBAR1(XBAR_INPUT, 93)     /* XBAR1_IN93 <- FLEXPWM4  PWM3_MUX_TRIGGER0 */
#define IMXRT_XBAR1_IN_LPIT1_LPIT_TRIG_OUT0                                     IMXRT_XBAR1(XBAR_INPUT, 94)     /* XBAR1_IN94 <- LPIT1  LPIT_TRIG_OUT0 */
#define IMXRT_XBAR1_IN_LPIT1_LPIT_TRIG_OUT1                                     IMXRT_XBAR1(XBAR_INPUT, 95)     /* XBAR1_IN95 <- LPIT1  LPIT_TRIG_OUT1 */
#define IMXRT_XBAR1_IN_LPIT1_LPIT_TRIG_OUT2                                     IMXRT_XBAR1(XBAR_INPUT, 96)     /* XBAR1_IN96 <- LPIT1  LPIT_TRIG_OUT2 */
#define IMXRT_XBAR1_IN_LPIT1_LPIT_TRIG_OUT3                                     IMXRT_XBAR1(XBAR_INPUT, 97)     /* XBAR1_IN97 <- LPIT1  LPIT_TRIG_OUT3 */
#define IMXRT_XBAR1_IN_LPIT2_LPIT_TRIG_OUT0                                     IMXRT_XBAR1(XBAR_INPUT, 98)     /* XBAR1_IN98 <- LPIT2  LPIT_TRIG_OUT0 */
#define IMXRT_XBAR1_IN_LPIT2_LPIT_TRIG_OUT1                                     IMXRT_XBAR1(XBAR_INPUT, 99)     /* XBAR1_IN99 <- LPIT2  LPIT_TRIG_OUT1 */
#define IMXRT_XBAR1_IN_LPIT2_LPIT_TRIG_OUT2                                     IMXRT_XBAR1(XBAR_INPUT, 100)    /* XBAR1_IN100 <- LPIT2  LPIT_TRIG_OUT2 */
#define IMXRT_XBAR1_IN_LPIT2_LPIT_TRIG_OUT3                                     IMXRT_XBAR1(XBAR_INPUT, 101)    /* XBAR1_IN101 <- LPIT2  LPIT_TRIG_OUT3 */
#define IMXRT_XBAR1_IN_LPIT3_LPIT_TRIG_OUT0                                     IMXRT_XBAR1(XBAR_INPUT, 102)    /* XBAR1_IN102 <- LPIT3  LPIT_TRIG_OUT0 */
#define IMXRT_XBAR1_IN_LPIT3_LPIT_TRIG_OUT1                                     IMXRT_XBAR1(XBAR_INPUT, 103)    /* XBAR1_IN103 <- LPIT3  LPIT_TRIG_OUT1 */
#define IMXRT_XBAR1_IN_LPIT3_LPIT_TRIG_OUT2                                     IMXRT_XBAR1(XBAR_INPUT, 104)    /* XBAR1_IN104 <- LPIT3  LPIT_TRIG_OUT2 */
#define IMXRT_XBAR1_IN_LPIT3_LPIT_TRIG_OUT3                                     IMXRT_XBAR1(XBAR_INPUT, 105)    /* XBAR1_IN105 <- LPIT3  LPIT_TRIG_OUT3 */
#define IMXRT_XBAR1_IN_TRIGGER_SY_TRIGGER_SYNC_OUT0_NC                          IMXRT_XBAR1(XBAR_INPUT, 106)    /* XBAR1_IN106 <- TRIGGER_SY TRIGGER_SYNC_OUT0  - NC */
#define IMXRT_XBAR1_IN_TRIGGER_SY_TRIGGER_SYNC_OUT1_NC                          IMXRT_XBAR1(XBAR_INPUT, 107)    /* XBAR1_IN107 <- TRIGGER_SY TRIGGER_SYNC_OUT1  - NC */
#define IMXRT_XBAR1_IN_TRIGGER_SY_TRIGGER_SYNC_OUT2_NC                          IMXRT_XBAR1(XBAR_INPUT, 108)    /* XBAR1_IN108 <- TRIGGER_SY TRIGGER_SYNC_OUT2  - NC */
#define IMXRT_XBAR1_IN_TRIGGER_SY_TRIGGER_SYNC_OUT3_NC                          IMXRT_XBAR1(XBAR_INPUT, 109)    /* XBAR1_IN109 <- TRIGGER_SY TRIGGER_SYNC_OUT3  - NC */
#define IMXRT_XBAR1_IN_EDMA4_DMA_TRIGGER_OUT0                                   IMXRT_XBAR1(XBAR_INPUT, 110)    /* XBAR1_IN110 <- eDMA4  DMA_TRIGGER_OUT0 */
#define IMXRT_XBAR1_IN_EDMA4_DMA_TRIGGER_OUT1                                   IMXRT_XBAR1(XBAR_INPUT, 111)    /* XBAR1_IN111 <- eDMA4  DMA_TRIGGER_OUT1 */
#define IMXRT_XBAR1_IN_EDMA4_DMA_TRIGGER_OUT2                                   IMXRT_XBAR1(XBAR_INPUT, 112)    /* XBAR1_IN112 <- eDMA4  DMA_TRIGGER_OUT2 */
#define IMXRT_XBAR1_IN_EDMA4_DMA_TRIGGER_OUT3                                   IMXRT_XBAR1(XBAR_INPUT, 113)    /* XBAR1_IN113 <- eDMA4  DMA_TRIGGER_OUT3 */
#define IMXRT_XBAR1_IN_EDMA4_DMA_TRIGGER_OUT4                                   IMXRT_XBAR1(XBAR_INPUT, 114)    /* XBAR1_IN114 <- eDMA4  DMA_TRIGGER_OUT4 */
#define IMXRT_XBAR1_IN_EDMA4_DMA_TRIGGER_OUT5                                   IMXRT_XBAR1(XBAR_INPUT, 115)    /* XBAR1_IN115 <- eDMA4  DMA_TRIGGER_OUT5 */
#define IMXRT_XBAR1_IN_EDMA4_DMA_TRIGGER_OUT6                                   IMXRT_XBAR1(XBAR_INPUT, 116)    /* XBAR1_IN116 <- eDMA4  DMA_TRIGGER_OUT6 */
#define IMXRT_XBAR1_IN_EDMA4_DMA_TRIGGER_OUT7                                   IMXRT_XBAR1(XBAR_INPUT, 117)    /* XBAR1_IN117 <- eDMA4  DMA_TRIGGER_OUT7 */
#define IMXRT_XBAR1_IN_EDMA3_DMA_TRIGGER_OUT0                                   IMXRT_XBAR1(XBAR_INPUT, 118)    /* XBAR1_IN118 <- eDMA3  DMA_TRIGGER_OUT0 */
#define IMXRT_XBAR1_IN_EDMA3_DMA_TRIGGER_OUT1                                   IMXRT_XBAR1(XBAR_INPUT, 119)    /* XBAR1_IN119 <- eDMA3  DMA_TRIGGER_OUT1 */
#define IMXRT_XBAR1_IN_EDMA3_DMA_TRIGGER_OUT2                                   IMXRT_XBAR1(XBAR_INPUT, 120)    /* XBAR1_IN120 <- eDMA3  DMA_TRIGGER_OUT2 */
#define IMXRT_XBAR1_IN_EDMA3_DMA_TRIGGER_OUT3                                   IMXRT_XBAR1(XBAR_INPUT, 121)    /* XBAR1_IN121 <- eDMA3  DMA_TRIGGER_OUT3 */
#define IMXRT_XBAR1_IN_EDMA3_DMA_TRIGGER_OUT4                                   IMXRT_XBAR1(XBAR_INPUT, 122)    /* XBAR1_IN122 <- eDMA3  DMA_TRIGGER_OUT4 */
#define IMXRT_XBAR1_IN_EDMA3_DMA_TRIGGER_OUT5                                   IMXRT_XBAR1(XBAR_INPUT, 123)    /* XBAR1_IN123 <- eDMA3  DMA_TRIGGER_OUT5 */
#define IMXRT_XBAR1_IN_EDMA3_DMA_TRIGGER_OUT6                                   IMXRT_XBAR1(XBAR_INPUT, 124)    /* XBAR1_IN124 <- eDMA3  DMA_TRIGGER_OUT6 */
#define IMXRT_XBAR1_IN_EDMA3_DMA_TRIGGER_OUT7                                   IMXRT_XBAR1(XBAR_INPUT, 125)    /* XBAR1_IN125 <- eDMA3  DMA_TRIGGER_OUT7 */
#define IMXRT_XBAR1_IN_ADC1_ADC_TCOMP_PULSE0                                    IMXRT_XBAR1(XBAR_INPUT, 126)    /* XBAR1_IN126 <- ADC1  ADC_TCOMP_PULSE0 */
#define IMXRT_XBAR1_IN_ADC1_ADC_TCOMP_PULSE1                                    IMXRT_XBAR1(XBAR_INPUT, 127)    /* XBAR1_IN127 <- ADC1  ADC_TCOMP_PULSE1 */
#define IMXRT_XBAR1_IN_ADC1_ADC_TCOMP_PULSE2                                    IMXRT_XBAR1(XBAR_INPUT, 128)    /* XBAR1_IN128 <- ADC1  ADC_TCOMP_PULSE2 */
#define IMXRT_XBAR1_IN_ADC1_ADC_TCOMP_PULSE3                                    IMXRT_XBAR1(XBAR_INPUT, 129)    /* XBAR1_IN129 <- ADC1  ADC_TCOMP_PULSE3 */
#define IMXRT_XBAR1_IN_ADC1_ADC_TCOMP_PULSE4                                    IMXRT_XBAR1(XBAR_INPUT, 130)    /* XBAR1_IN130 <- ADC1  ADC_TCOMP_PULSE4 */
#define IMXRT_XBAR1_IN_ADC1_ADC_TCOMP_PULSE5                                    IMXRT_XBAR1(XBAR_INPUT, 131)    /* XBAR1_IN131 <- ADC1  ADC_TCOMP_PULSE5 */
#define IMXRT_XBAR1_IN_ADC1_ADC_TCOMP_PULSE6                                    IMXRT_XBAR1(XBAR_INPUT, 132)    /* XBAR1_IN132 <- ADC1  ADC_TCOMP_PULSE6 */
#define IMXRT_XBAR1_IN_ADC1_ADC_TCOMP_PULSE7                                    IMXRT_XBAR1(XBAR_INPUT, 133)    /* XBAR1_IN133 <- ADC1  ADC_TCOMP_PULSE7 */
#define IMXRT_XBAR1_IN_ADC2_ADC_TCOMP_PULSE0                                    IMXRT_XBAR1(XBAR_INPUT, 134)    /* XBAR1_IN134 <- ADC2  ADC_TCOMP_PULSE0 */
