apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_xbar.h
#define IMXRT_XBAR1_IN_ADC2_ADC_TCOMP_PULSE1                                    IMXRT_XBAR1(XBAR_INPUT, 135)    /* XBAR1_IN135 <- ADC2  ADC_TCOMP_PULSE1 */
#define IMXRT_XBAR1_IN_ADC2_ADC_TCOMP_PULSE2                                    IMXRT_XBAR1(XBAR_INPUT, 136)    /* XBAR1_IN136 <- ADC2  ADC_TCOMP_PULSE2 */
#define IMXRT_XBAR1_IN_ADC2_ADC_TCOMP_PULSE3                                    IMXRT_XBAR1(XBAR_INPUT, 137)    /* XBAR1_IN137 <- ADC2  ADC_TCOMP_PULSE3 */
#define IMXRT_XBAR1_IN_ADC2_ADC_TCOMP_PULSE4                                    IMXRT_XBAR1(XBAR_INPUT, 138)    /* XBAR1_IN138 <- ADC2  ADC_TCOMP_PULSE4 */
#define IMXRT_XBAR1_IN_ADC2_ADC_TCOMP_PULSE5                                    IMXRT_XBAR1(XBAR_INPUT, 139)    /* XBAR1_IN139 <- ADC2  ADC_TCOMP_PULSE5 */
#define IMXRT_XBAR1_IN_ADC2_ADC_TCOMP_PULSE6                                    IMXRT_XBAR1(XBAR_INPUT, 140)    /* XBAR1_IN140 <- ADC2  ADC_TCOMP_PULSE6 */
#define IMXRT_XBAR1_IN_ADC2_ADC_TCOMP_PULSE7                                    IMXRT_XBAR1(XBAR_INPUT, 141)    /* XBAR1_IN141 <- ADC2  ADC_TCOMP_PULSE7 */
#define IMXRT_XBAR1_IN_TPM1_TPM_CH_TRIGGER0                                     IMXRT_XBAR1(XBAR_INPUT, 142)    /* XBAR1_IN142 <- TPM1  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR1_IN_TPM1_TPM_CH_TRIGGER1                                     IMXRT_XBAR1(XBAR_INPUT, 143)    /* XBAR1_IN143 <- TPM1  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR1_IN_TPM1_TPM_CH_TRIGGER2                                     IMXRT_XBAR1(XBAR_INPUT, 144)    /* XBAR1_IN144 <- TPM1  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR1_IN_TPM1_TPM_CH_TRIGGER3                                     IMXRT_XBAR1(XBAR_INPUT, 145)    /* XBAR1_IN145 <- TPM1  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR1_IN_TPM1_TPM_TRIGGER                                         IMXRT_XBAR1(XBAR_INPUT, 146)    /* XBAR1_IN146 <- TPM1  TPM_TRIGGER */
#define IMXRT_XBAR1_IN_TPM2_TPM_CH_TRIGGER0                                     IMXRT_XBAR1(XBAR_INPUT, 147)    /* XBAR1_IN147 <- TPM2  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR1_IN_TPM2_TPM_CH_TRIGGER1                                     IMXRT_XBAR1(XBAR_INPUT, 148)    /* XBAR1_IN148 <- TPM2  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR1_IN_TPM2_TPM_CH_TRIGGER2                                     IMXRT_XBAR1(XBAR_INPUT, 149)    /* XBAR1_IN149 <- TPM2  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR1_IN_TPM2_TPM_CH_TRIGGER3                                     IMXRT_XBAR1(XBAR_INPUT, 150)    /* XBAR1_IN150 <- TPM2  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR1_IN_TPM2_TPM_TRIGGER                                         IMXRT_XBAR1(XBAR_INPUT, 151)    /* XBAR1_IN151 <- TPM2  TPM_TRIGGER */
#define IMXRT_XBAR1_IN_TPM3_TPM_CH_TRIGGER0                                     IMXRT_XBAR1(XBAR_INPUT, 152)    /* XBAR1_IN152 <- TPM3  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR1_IN_TPM3_TPM_CH_TRIGGER1                                     IMXRT_XBAR1(XBAR_INPUT, 153)    /* XBAR1_IN153 <- TPM3  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR1_IN_TPM3_TPM_CH_TRIGGER2                                     IMXRT_XBAR1(XBAR_INPUT, 154)    /* XBAR1_IN154 <- TPM3  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR1_IN_TPM3_TPM_CH_TRIGGER3                                     IMXRT_XBAR1(XBAR_INPUT, 155)    /* XBAR1_IN155 <- TPM3  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR1_IN_TPM3_TPM_TRIGGER                                         IMXRT_XBAR1(XBAR_INPUT, 156)    /* XBAR1_IN156 <- TPM3  TPM_TRIGGER */
#define IMXRT_XBAR1_IN_TPM4_TPM_CH_TRIGGER0                                     IMXRT_XBAR1(XBAR_INPUT, 157)    /* XBAR1_IN157 <- TPM4  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR1_IN_TPM4_TPM_CH_TRIGGER1                                     IMXRT_XBAR1(XBAR_INPUT, 158)    /* XBAR1_IN158 <- TPM4  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR1_IN_TPM4_TPM_CH_TRIGGER2                                     IMXRT_XBAR1(XBAR_INPUT, 159)    /* XBAR1_IN159 <- TPM4  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR1_IN_TPM4_TPM_CH_TRIGGER3                                     IMXRT_XBAR1(XBAR_INPUT, 160)    /* XBAR1_IN160 <- TPM4  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR1_IN_TPM4_TPM_TRIGGER                                         IMXRT_XBAR1(XBAR_INPUT, 161)    /* XBAR1_IN161 <- TPM4  TPM_TRIGGER */
#define IMXRT_XBAR1_IN_TPM5_TPM_CH_TRIGGER0                                     IMXRT_XBAR1(XBAR_INPUT, 162)    /* XBAR1_IN162 <- TPM5  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR1_IN_TPM5_TPM_CH_TRIGGER1                                     IMXRT_XBAR1(XBAR_INPUT, 163)    /* XBAR1_IN163 <- TPM5  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR1_IN_TPM5_TPM_CH_TRIGGER2                                     IMXRT_XBAR1(XBAR_INPUT, 164)    /* XBAR1_IN164 <- TPM5  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR1_IN_TPM5_TPM_CH_TRIGGER3                                     IMXRT_XBAR1(XBAR_INPUT, 165)    /* XBAR1_IN165 <- TPM5  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR1_IN_TPM5_TPM_TRIGGER                                         IMXRT_XBAR1(XBAR_INPUT, 166)    /* XBAR1_IN166 <- TPM5  TPM_TRIGGER */
#define IMXRT_XBAR1_IN_TPM6_TPM_CH_TRIGGER0                                     IMXRT_XBAR1(XBAR_INPUT, 167)    /* XBAR1_IN167 <- TPM6  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR1_IN_TPM6_TPM_CH_TRIGGER1                                     IMXRT_XBAR1(XBAR_INPUT, 168)    /* XBAR1_IN168 <- TPM6  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR1_IN_TPM6_TPM_CH_TRIGGER2                                     IMXRT_XBAR1(XBAR_INPUT, 169)    /* XBAR1_IN169 <- TPM6  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR1_IN_TPM6_TPM_CH_TRIGGER3                                     IMXRT_XBAR1(XBAR_INPUT, 170)    /* XBAR1_IN170 <- TPM6  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR1_IN_TPM6_TPM_TRIGGER                                         IMXRT_XBAR1(XBAR_INPUT, 171)    /* XBAR1_IN171 <- TPM6  TPM_TRIGGER */
#define IMXRT_XBAR1_IN_LPTMR1_LPTIMER_TRIGGER_DELAY                             IMXRT_XBAR1(XBAR_INPUT, 172)    /* XBAR1_IN172 <- LPTMR1  LPTIMER_TRIGGER_DELAY */
#define IMXRT_XBAR1_IN_LPTMR2_LPTIMER_TRIGGER_DELAY                             IMXRT_XBAR1(XBAR_INPUT, 173)    /* XBAR1_IN173 <- LPTMR2  LPTIMER_TRIGGER_DELAY */
#define IMXRT_XBAR1_IN_LPTMR3_LPTIMER_TRIGGER_DELAY                             IMXRT_XBAR1(XBAR_INPUT, 174)    /* XBAR1_IN174 <- LPTMR3  LPTIMER_TRIGGER_DELAY */
#define IMXRT_XBAR1_IN_NETC_TMR_1588_PP1                                        IMXRT_XBAR1(XBAR_INPUT, 175)    /* XBAR1_IN175 <- NETC  TMR_1588_PP1 */
#define IMXRT_XBAR1_IN_NETC_TMR_1588_PP2                                        IMXRT_XBAR1(XBAR_INPUT, 176)    /* XBAR1_IN176 <- NETC  TMR_1588_PP2 */
#define IMXRT_XBAR1_IN_NETC_TMR_1588_PP3                                        IMXRT_XBAR1(XBAR_INPUT, 177)    /* XBAR1_IN177 <- NETC  TMR_1588_PP3 */
#define IMXRT_XBAR1_IN_SINC1_CHANNEL_0_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR1(XBAR_INPUT, 178)    /* XBAR1_IN178 <- SINC1  Channel 0 break due to clock absence detected */
#define IMXRT_XBAR1_IN_SINC1_CHANNEL_1_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR1(XBAR_INPUT, 179)    /* XBAR1_IN179 <- SINC1  Channel 1 break due to clock absence detected */
#define IMXRT_XBAR1_IN_SINC1_CHANNEL_2_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR1(XBAR_INPUT, 180)    /* XBAR1_IN180 <- SINC1  Channel 2 break due to clock absence detected */
#define IMXRT_XBAR1_IN_SINC1_CHANNEL_3_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR1(XBAR_INPUT, 181)    /* XBAR1_IN181 <- SINC1  Channel 3 break due to clock absence detected */
#define IMXRT_XBAR1_IN_SINC2_CHANNEL_0_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR1(XBAR_INPUT, 182)    /* XBAR1_IN182 <- SINC2  Channel 0 break due to clock absence detected */
#define IMXRT_XBAR1_IN_SINC2_CHANNEL_1_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR1(XBAR_INPUT, 183)    /* XBAR1_IN183 <- SINC2  Channel 1 break due to clock absence detected */
#define IMXRT_XBAR1_IN_SINC2_CHANNEL_2_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR1(XBAR_INPUT, 184)    /* XBAR1_IN184 <- SINC2  Channel 2 break due to clock absence detected */
#define IMXRT_XBAR1_IN_SINC2_CHANNEL_3_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR1(XBAR_INPUT, 185)    /* XBAR1_IN185 <- SINC2  Channel 3 break due to clock absence detected */
#define IMXRT_XBAR1_IN_SINC3_CHANNEL_0_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR1(XBAR_INPUT, 186)    /* XBAR1_IN186 <- SINC3  Channel 0 break due to clock absence detected */
#define IMXRT_XBAR1_IN_SINC3_CHANNEL_1_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR1(XBAR_INPUT, 187)    /* XBAR1_IN187 <- SINC3  Channel 1 break due to clock absence detected */
#define IMXRT_XBAR1_IN_SINC3_CHANNEL_2_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR1(XBAR_INPUT, 188)    /* XBAR1_IN188 <- SINC3  Channel 2 break due to clock absence detected */
#define IMXRT_XBAR1_IN_SINC3_CHANNEL_3_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR1(XBAR_INPUT, 189)    /* XBAR1_IN189 <- SINC3  Channel 3 break due to clock absence detected */
#define IMXRT_XBAR1_IN_AOI1_AOI_OUT0                                            IMXRT_XBAR1(XBAR_INPUT, 190)    /* XBAR1_IN190 <- AOI1  AOI_OUT0 */
#define IMXRT_XBAR1_IN_AOI1_AOI_OUT1                                            IMXRT_XBAR1(XBAR_INPUT, 191)    /* XBAR1_IN191 <- AOI1  AOI_OUT1 */
#define IMXRT_XBAR1_IN_AOI1_AOI_OUT2                                            IMXRT_XBAR1(XBAR_INPUT, 192)    /* XBAR1_IN192 <- AOI1  AOI_OUT2 */
#define IMXRT_XBAR1_IN_AOI1_AOI_OUT3                                            IMXRT_XBAR1(XBAR_INPUT, 193)    /* XBAR1_IN193 <- AOI1  AOI_OUT3 */
#define IMXRT_XBAR1_IN_AOI2_AOI_OUT0                                            IMXRT_XBAR1(XBAR_INPUT, 194)    /* XBAR1_IN194 <- AOI2  AOI_OUT0 */
#define IMXRT_XBAR1_IN_AOI2_AOI_OUT1                                            IMXRT_XBAR1(XBAR_INPUT, 195)    /* XBAR1_IN195 <- AOI2  AOI_OUT1 */
#define IMXRT_XBAR1_IN_AOI2_AOI_OUT2                                            IMXRT_XBAR1(XBAR_INPUT, 196)    /* XBAR1_IN196 <- AOI2  AOI_OUT2 */
#define IMXRT_XBAR1_IN_AOI2_AOI_OUT3                                            IMXRT_XBAR1(XBAR_INPUT, 197)    /* XBAR1_IN197 <- AOI2  AOI_OUT3 */
#define IMXRT_XBAR1_IN_TRIGGER_SY_TRIGGER_SYNC_OUT4_NC                          IMXRT_XBAR1(XBAR_INPUT, 198)    /* XBAR1_IN198 <- TRIGGER_SY TRIGGER_SYNC_OUT4  - NC */
#define IMXRT_XBAR1_IN_TRIGGER_SY_TRIGGER_SYNC_OUT5_NC                          IMXRT_XBAR1(XBAR_INPUT, 199)    /* XBAR1_IN199 <- TRIGGER_SY TRIGGER_SYNC_OUT5  - NC */
#define IMXRT_XBAR1_IN_TRIGGER_SY_TRIGGER_SYNC_OUT6_NC                          IMXRT_XBAR1(XBAR_INPUT, 200)    /* XBAR1_IN200 <- TRIGGER_SY TRIGGER_SYNC_OUT6  - NC */
#define IMXRT_XBAR1_IN_TRIGGER_SY_TRIGGER_SYNC_OUT7_NC                          IMXRT_XBAR1(XBAR_INPUT, 201)    /* XBAR1_IN201 <- TRIGGER_SY TRIGGER_SYNC_OUT7  - NC */
#define IMXRT_XBAR1_IN_RESERVED                                                 IMXRT_XBAR1(XBAR_INPUT, 202)    /* XBAR1_IN202 <- -  Reserved */
#define IMXRT_XBAR1_IN_RESERVED_2                                               IMXRT_XBAR1(XBAR_INPUT, 203)    /* XBAR1_IN203 <- -  Reserved */
#define IMXRT_XBAR1_IN_RESERVED_3                                               IMXRT_XBAR1(XBAR_INPUT, 204)    /* XBAR1_IN204 <- -  Reserved */
#define IMXRT_XBAR1_IN_RESERVED_4                                               IMXRT_XBAR1(XBAR_INPUT, 205)    /* XBAR1_IN205 <- -  Reserved */
#define IMXRT_XBAR1_IN_AOI3_AOI_OUT0                                            IMXRT_XBAR1(XBAR_INPUT, 206)    /* XBAR1_IN206 <- AOI3  AOI_OUT0 */
#define IMXRT_XBAR1_IN_AOI3_AOI_OUT1                                            IMXRT_XBAR1(XBAR_INPUT, 207)    /* XBAR1_IN207 <- AOI3  AOI_OUT1 */
#define IMXRT_XBAR1_IN_AOI3_AOI_OUT2                                            IMXRT_XBAR1(XBAR_INPUT, 208)    /* XBAR1_IN208 <- AOI3  AOI_OUT2 */
#define IMXRT_XBAR1_IN_AOI3_AOI_OUT3                                            IMXRT_XBAR1(XBAR_INPUT, 209)    /* XBAR1_IN209 <- AOI3  AOI_OUT3 */
#define IMXRT_XBAR1_IN_AOI4_AOI_OUT0                                            IMXRT_XBAR1(XBAR_INPUT, 210)    /* XBAR1_IN210 <- AOI4  AOI_OUT0 */
#define IMXRT_XBAR1_IN_AOI4_AOI_OUT1                                            IMXRT_XBAR1(XBAR_INPUT, 211)    /* XBAR1_IN211 <- AOI4  AOI_OUT1 */
#define IMXRT_XBAR1_IN_AOI4_AOI_OUT2                                            IMXRT_XBAR1(XBAR_INPUT, 212)    /* XBAR1_IN212 <- AOI4  AOI_OUT2 */
#define IMXRT_XBAR1_IN_AOI4_AOI_OUT3                                            IMXRT_XBAR1(XBAR_INPUT, 213)    /* XBAR1_IN213 <- AOI4  AOI_OUT3 */
#define IMXRT_XBAR1_IN_ECAT_SYNC_OUT0                                           IMXRT_XBAR1(XBAR_INPUT, 214)    /* XBAR1_IN214 <- ECAT  SYNC_OUT0 */
#define IMXRT_XBAR1_IN_ECAT_SYNC_OUT1                                           IMXRT_XBAR1(XBAR_INPUT, 215)    /* XBAR1_IN215 <- ECAT  SYNC_OUT1 */

