apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_xbar.h
#define IMXRT_XBAR2_IN_GND                                                      IMXRT_XBAR2(XBAR_INPUT, 0)      /* XBAR2_IN0 <- -  GND */
#define IMXRT_XBAR2_IN_1B1                                                      IMXRT_XBAR2(XBAR_INPUT, 1)      /* XBAR2_IN1 <- -  1'B1 */
#define IMXRT_XBAR2_IN_GND_2                                                    IMXRT_XBAR2(XBAR_INPUT, 2)      /* XBAR2_IN2 <- -  GND */
#define IMXRT_XBAR2_IN_1B1_2                                                    IMXRT_XBAR2(XBAR_INPUT, 3)      /* XBAR2_IN3 <- -  1'B1 */
#define IMXRT_XBAR2_IN_CMP1_COUT                                                IMXRT_XBAR2(XBAR_INPUT, 4)      /* XBAR2_IN4 <- CMP1  COUT */
#define IMXRT_XBAR2_IN_CMP2_COUT                                                IMXRT_XBAR2(XBAR_INPUT, 5)      /* XBAR2_IN5 <- CMP2  COUT */
#define IMXRT_XBAR2_IN_CMP3_COUT                                                IMXRT_XBAR2(XBAR_INPUT, 6)      /* XBAR2_IN6 <- CMP3  COUT */
#define IMXRT_XBAR2_IN_CMP4_COUT                                                IMXRT_XBAR2(XBAR_INPUT, 7)      /* XBAR2_IN7 <- CMP4  COUT */
#define IMXRT_XBAR2_IN_TMR1_TMR0_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 8)      /* XBAR2_IN8 <- TMR1  TMR0_OUTPUT */
#define IMXRT_XBAR2_IN_TMR1_TMR1_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 9)      /* XBAR2_IN9 <- TMR1  TMR1_OUTPUT */
#define IMXRT_XBAR2_IN_TMR1_TMR2_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 10)     /* XBAR2_IN10 <- TMR1  TMR2_OUTPUT */
#define IMXRT_XBAR2_IN_TMR1_TMR3_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 11)     /* XBAR2_IN11 <- TMR1  TMR3_OUTPUT */
#define IMXRT_XBAR2_IN_TMR2_TMR0_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 12)     /* XBAR2_IN12 <- TMR2  TMR0_OUTPUT */
#define IMXRT_XBAR2_IN_TMR2_TMR1_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 13)     /* XBAR2_IN13 <- TMR2  TMR1_OUTPUT */
#define IMXRT_XBAR2_IN_TMR2_TMR2_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 14)     /* XBAR2_IN14 <- TMR2  TMR2_OUTPUT */
#define IMXRT_XBAR2_IN_TMR2_TMR3_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 15)     /* XBAR2_IN15 <- TMR2  TMR3_OUTPUT */
#define IMXRT_XBAR2_IN_TMR3_TMR0_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 16)     /* XBAR2_IN16 <- TMR3  TMR0_OUTPUT */
#define IMXRT_XBAR2_IN_TMR3_TMR1_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 17)     /* XBAR2_IN17 <- TMR3  TMR1_OUTPUT */
#define IMXRT_XBAR2_IN_TMR3_TMR2_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 18)     /* XBAR2_IN18 <- TMR3  TMR2_OUTPUT */
#define IMXRT_XBAR2_IN_TMR3_TMR3_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 19)     /* XBAR2_IN19 <- TMR3  TMR3_OUTPUT */
#define IMXRT_XBAR2_IN_TMR4_TMR0_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 20)     /* XBAR2_IN20 <- TMR4  TMR0_OUTPUT */
#define IMXRT_XBAR2_IN_TMR4_TMR1_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 21)     /* XBAR2_IN21 <- TMR4  TMR1_OUTPUT */
#define IMXRT_XBAR2_IN_TMR4_TMR2_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 22)     /* XBAR2_IN22 <- TMR4  TMR2_OUTPUT */
#define IMXRT_XBAR2_IN_TMR4_TMR3_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 23)     /* XBAR2_IN23 <- TMR4  TMR3_OUTPUT */
#define IMXRT_XBAR2_IN_TMR5_TMR0_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 24)     /* XBAR2_IN24 <- TMR5  TMR0_OUTPUT */
#define IMXRT_XBAR2_IN_TMR5_TMR1_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 25)     /* XBAR2_IN25 <- TMR5  TMR1_OUTPUT */
#define IMXRT_XBAR2_IN_TMR5_TMR2_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 26)     /* XBAR2_IN26 <- TMR5  TMR2_OUTPUT */
#define IMXRT_XBAR2_IN_TMR5_TMR3_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 27)     /* XBAR2_IN27 <- TMR5  TMR3_OUTPUT */
#define IMXRT_XBAR2_IN_TMR6_TMR0_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 28)     /* XBAR2_IN28 <- TMR6  TMR0_OUTPUT */
#define IMXRT_XBAR2_IN_TMR6_TMR1_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 29)     /* XBAR2_IN29 <- TMR6  TMR1_OUTPUT */
#define IMXRT_XBAR2_IN_TMR6_TMR2_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 30)     /* XBAR2_IN30 <- TMR6  TMR2_OUTPUT */
#define IMXRT_XBAR2_IN_TMR6_TMR3_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 31)     /* XBAR2_IN31 <- TMR6  TMR3_OUTPUT */
#define IMXRT_XBAR2_IN_TMR7_TMR0_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 32)     /* XBAR2_IN32 <- TMR7  TMR0_OUTPUT */
#define IMXRT_XBAR2_IN_TMR7_TMR1_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 33)     /* XBAR2_IN33 <- TMR7  TMR1_OUTPUT */
#define IMXRT_XBAR2_IN_TMR7_TMR2_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 34)     /* XBAR2_IN34 <- TMR7  TMR2_OUTPUT */
#define IMXRT_XBAR2_IN_TMR7_TMR3_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 35)     /* XBAR2_IN35 <- TMR7  TMR3_OUTPUT */
#define IMXRT_XBAR2_IN_TMR8_TMR0_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 36)     /* XBAR2_IN36 <- TMR8  TMR0_OUTPUT */
#define IMXRT_XBAR2_IN_TMR8_TMR1_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 37)     /* XBAR2_IN37 <- TMR8  TMR1_OUTPUT */
#define IMXRT_XBAR2_IN_TMR8_TMR2_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 38)     /* XBAR2_IN38 <- TMR8  TMR2_OUTPUT */
#define IMXRT_XBAR2_IN_TMR8_TMR3_OUTPUT                                         IMXRT_XBAR2(XBAR_INPUT, 39)     /* XBAR2_IN39 <- TMR8  TMR3_OUTPUT */
#define IMXRT_XBAR2_IN_FLEXPWM1_PWM0_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 40)     /* XBAR2_IN40 <- FLEXPWM1  PWM0_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM1_PWM1_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 41)     /* XBAR2_IN41 <- FLEXPWM1  PWM1_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM1_PWM2_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 42)     /* XBAR2_IN42 <- FLEXPWM1  PWM2_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM1_PWM3_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 43)     /* XBAR2_IN43 <- FLEXPWM1  PWM3_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM2_PWM0_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 44)     /* XBAR2_IN44 <- FLEXPWM2  PWM0_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM2_PWM1_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 45)     /* XBAR2_IN45 <- FLEXPWM2  PWM1_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM2_PWM2_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 46)     /* XBAR2_IN46 <- FLEXPWM2  PWM2_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM2_PWM3_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 47)     /* XBAR2_IN47 <- FLEXPWM2  PWM3_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM3_PWM0_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 48)     /* XBAR2_IN48 <- FLEXPWM3  PWM0_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM3_PWM1_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 49)     /* XBAR2_IN49 <- FLEXPWM3  PWM1_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM3_PWM2_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 50)     /* XBAR2_IN50 <- FLEXPWM3  PWM2_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM3_PWM3_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 51)     /* XBAR2_IN51 <- FLEXPWM3  PWM3_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM4_PWM0_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 52)     /* XBAR2_IN52 <- FLEXPWM4  PWM0_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM4_PWM1_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 53)     /* XBAR2_IN53 <- FLEXPWM4  PWM1_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM4_PWM2_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 54)     /* XBAR2_IN54 <- FLEXPWM4  PWM2_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_FLEXPWM4_PWM3_MUX_TRIGGER0                               IMXRT_XBAR2(XBAR_INPUT, 55)     /* XBAR2_IN55 <- FLEXPWM4  PWM3_MUX_TRIGGER0 */
#define IMXRT_XBAR2_IN_LPIT1_LPIT_TRIG_OUT0                                     IMXRT_XBAR2(XBAR_INPUT, 56)     /* XBAR2_IN56 <- LPIT1  LPIT_TRIG_OUT0 */
#define IMXRT_XBAR2_IN_LPIT1_LPIT_TRIG_OUT1                                     IMXRT_XBAR2(XBAR_INPUT, 57)     /* XBAR2_IN57 <- LPIT1  LPIT_TRIG_OUT1 */
#define IMXRT_XBAR2_IN_LPIT1_LPIT_TRIG_OUT2                                     IMXRT_XBAR2(XBAR_INPUT, 58)     /* XBAR2_IN58 <- LPIT1  LPIT_TRIG_OUT2 */
#define IMXRT_XBAR2_IN_LPIT1_LPIT_TRIG_OUT3                                     IMXRT_XBAR2(XBAR_INPUT, 59)     /* XBAR2_IN59 <- LPIT1  LPIT_TRIG_OUT3 */
#define IMXRT_XBAR2_IN_LPIT2_LPIT_TRIG_OUT0                                     IMXRT_XBAR2(XBAR_INPUT, 60)     /* XBAR2_IN60 <- LPIT2  LPIT_TRIG_OUT0 */
#define IMXRT_XBAR2_IN_LPIT2_LPIT_TRIG_OUT1                                     IMXRT_XBAR2(XBAR_INPUT, 61)     /* XBAR2_IN61 <- LPIT2  LPIT_TRIG_OUT1 */
#define IMXRT_XBAR2_IN_LPIT2_LPIT_TRIG_OUT2                                     IMXRT_XBAR2(XBAR_INPUT, 62)     /* XBAR2_IN62 <- LPIT2  LPIT_TRIG_OUT2 */
#define IMXRT_XBAR2_IN_LPIT2_LPIT_TRIG_OUT3                                     IMXRT_XBAR2(XBAR_INPUT, 63)     /* XBAR2_IN63 <- LPIT2  LPIT_TRIG_OUT3 */
#define IMXRT_XBAR2_IN_LPIT3_LPIT_TRIG_OUT0                                     IMXRT_XBAR2(XBAR_INPUT, 64)     /* XBAR2_IN64 <- LPIT3  LPIT_TRIG_OUT0 */
#define IMXRT_XBAR2_IN_LPIT3_LPIT_TRIG_OUT1                                     IMXRT_XBAR2(XBAR_INPUT, 65)     /* XBAR2_IN65 <- LPIT3  LPIT_TRIG_OUT1 */
#define IMXRT_XBAR2_IN_LPIT3_LPIT_TRIG_OUT2                                     IMXRT_XBAR2(XBAR_INPUT, 66)     /* XBAR2_IN66 <- LPIT3  LPIT_TRIG_OUT2 */
#define IMXRT_XBAR2_IN_LPIT3_LPIT_TRIG_OUT3                                     IMXRT_XBAR2(XBAR_INPUT, 67)     /* XBAR2_IN67 <- LPIT3  LPIT_TRIG_OUT3 */
#define IMXRT_XBAR2_IN_SINC1_PULSE_TRG0                                         IMXRT_XBAR2(XBAR_INPUT, 68)     /* XBAR2_IN68 <- SINC1  PULSE_TRG0 */
#define IMXRT_XBAR2_IN_SINC1_PULSE_TRG1                                         IMXRT_XBAR2(XBAR_INPUT, 69)     /* XBAR2_IN69 <- SINC1  PULSE_TRG1 */
#define IMXRT_XBAR2_IN_SINC1_PULSE_TRG2                                         IMXRT_XBAR2(XBAR_INPUT, 70)     /* XBAR2_IN70 <- SINC1  PULSE_TRG2 */
#define IMXRT_XBAR2_IN_SINC1_PULSE_TRG3                                         IMXRT_XBAR2(XBAR_INPUT, 71)     /* XBAR2_IN71 <- SINC1  PULSE_TRG3 */
#define IMXRT_XBAR2_IN_EDMA4_DMA_TRIGGER_OUT0                                   IMXRT_XBAR2(XBAR_INPUT, 72)     /* XBAR2_IN72 <- eDMA4  DMA_TRIGGER_OUT0 */
#define IMXRT_XBAR2_IN_EDMA4_DMA_TRIGGER_OUT1                                   IMXRT_XBAR2(XBAR_INPUT, 73)     /* XBAR2_IN73 <- eDMA4  DMA_TRIGGER_OUT1 */
#define IMXRT_XBAR2_IN_EDMA4_DMA_TRIGGER_OUT2                                   IMXRT_XBAR2(XBAR_INPUT, 74)     /* XBAR2_IN74 <- eDMA4  DMA_TRIGGER_OUT2 */
#define IMXRT_XBAR2_IN_EDMA4_DMA_TRIGGER_OUT3                                   IMXRT_XBAR2(XBAR_INPUT, 75)     /* XBAR2_IN75 <- eDMA4  DMA_TRIGGER_OUT3 */
#define IMXRT_XBAR2_IN_EDMA4_DMA_TRIGGER_OUT4                                   IMXRT_XBAR2(XBAR_INPUT, 76)     /* XBAR2_IN76 <- eDMA4  DMA_TRIGGER_OUT4 */
#define IMXRT_XBAR2_IN_EDMA4_DMA_TRIGGER_OUT5                                   IMXRT_XBAR2(XBAR_INPUT, 77)     /* XBAR2_IN77 <- eDMA4  DMA_TRIGGER_OUT5 */
#define IMXRT_XBAR2_IN_EDMA4_DMA_TRIGGER_OUT6                                   IMXRT_XBAR2(XBAR_INPUT, 78)     /* XBAR2_IN78 <- eDMA4  DMA_TRIGGER_OUT6 */
#define IMXRT_XBAR2_IN_EDMA4_DMA_TRIGGER_OUT7                                   IMXRT_XBAR2(XBAR_INPUT, 79)     /* XBAR2_IN79 <- eDMA4  DMA_TRIGGER_OUT7 */
#define IMXRT_XBAR2_IN_EDMA3_DMA_TRIGGER_OUT0                                   IMXRT_XBAR2(XBAR_INPUT, 80)     /* XBAR2_IN80 <- eDMA3  DMA_TRIGGER_OUT0 */
#define IMXRT_XBAR2_IN_EDMA3_DMA_TRIGGER_OUT1                                   IMXRT_XBAR2(XBAR_INPUT, 81)     /* XBAR2_IN81 <- eDMA3  DMA_TRIGGER_OUT1 */
#define IMXRT_XBAR2_IN_EDMA3_DMA_TRIGGER_OUT2                                   IMXRT_XBAR2(XBAR_INPUT, 82)     /* XBAR2_IN82 <- eDMA3  DMA_TRIGGER_OUT2 */
#define IMXRT_XBAR2_IN_EDMA3_DMA_TRIGGER_OUT3                                   IMXRT_XBAR2(XBAR_INPUT, 83)     /* XBAR2_IN83 <- eDMA3  DMA_TRIGGER_OUT3 */
#define IMXRT_XBAR2_IN_EDMA3_DMA_TRIGGER_OUT4                                   IMXRT_XBAR2(XBAR_INPUT, 84)     /* XBAR2_IN84 <- eDMA3  DMA_TRIGGER_OUT4 */
#define IMXRT_XBAR2_IN_EDMA3_DMA_TRIGGER_OUT5                                   IMXRT_XBAR2(XBAR_INPUT, 85)     /* XBAR2_IN85 <- eDMA3  DMA_TRIGGER_OUT5 */
#define IMXRT_XBAR2_IN_EDMA3_DMA_TRIGGER_OUT6                                   IMXRT_XBAR2(XBAR_INPUT, 86)     /* XBAR2_IN86 <- eDMA3  DMA_TRIGGER_OUT6 */
#define IMXRT_XBAR2_IN_EDMA3_DMA_TRIGGER_OUT7                                   IMXRT_XBAR2(XBAR_INPUT, 87)     /* XBAR2_IN87 <- eDMA3  DMA_TRIGGER_OUT7 */
#define IMXRT_XBAR2_IN_ADC1_ADC_TCOMP_PULSE0                                    IMXRT_XBAR2(XBAR_INPUT, 88)     /* XBAR2_IN88 <- ADC1  ADC_TCOMP_PULSE0 */
#define IMXRT_XBAR2_IN_ADC1_ADC_TCOMP_PULSE1                                    IMXRT_XBAR2(XBAR_INPUT, 89)     /* XBAR2_IN89 <- ADC1  ADC_TCOMP_PULSE1 */
#define IMXRT_XBAR2_IN_ADC1_ADC_TCOMP_PULSE2                                    IMXRT_XBAR2(XBAR_INPUT, 90)     /* XBAR2_IN90 <- ADC1  ADC_TCOMP_PULSE2 */
#define IMXRT_XBAR2_IN_ADC1_ADC_TCOMP_PULSE3                                    IMXRT_XBAR2(XBAR_INPUT, 91)     /* XBAR2_IN91 <- ADC1  ADC_TCOMP_PULSE3 */
#define IMXRT_XBAR2_IN_ADC1_ADC_TCOMP_PULSE4                                    IMXRT_XBAR2(XBAR_INPUT, 92)     /* XBAR2_IN92 <- ADC1  ADC_TCOMP_PULSE4 */
#define IMXRT_XBAR2_IN_ADC1_ADC_TCOMP_PULSE5                                    IMXRT_XBAR2(XBAR_INPUT, 93)     /* XBAR2_IN93 <- ADC1  ADC_TCOMP_PULSE5 */
#define IMXRT_XBAR2_IN_ADC1_ADC_TCOMP_PULSE6                                    IMXRT_XBAR2(XBAR_INPUT, 94)     /* XBAR2_IN94 <- ADC1  ADC_TCOMP_PULSE6 */
#define IMXRT_XBAR2_IN_ADC1_ADC_TCOMP_PULSE7                                    IMXRT_XBAR2(XBAR_INPUT, 95)     /* XBAR2_IN95 <- ADC1  ADC_TCOMP_PULSE7 */
#define IMXRT_XBAR2_IN_ADC2_ADC_TCOMP_PULSE0                                    IMXRT_XBAR2(XBAR_INPUT, 96)     /* XBAR2_IN96 <- ADC2  ADC_TCOMP_PULSE0 */
#define IMXRT_XBAR2_IN_ADC2_ADC_TCOMP_PULSE1                                    IMXRT_XBAR2(XBAR_INPUT, 97)     /* XBAR2_IN97 <- ADC2  ADC_TCOMP_PULSE1 */
#define IMXRT_XBAR2_IN_ADC2_ADC_TCOMP_PULSE2                                    IMXRT_XBAR2(XBAR_INPUT, 98)     /* XBAR2_IN98 <- ADC2  ADC_TCOMP_PULSE2 */
#define IMXRT_XBAR2_IN_ADC2_ADC_TCOMP_PULSE3                                    IMXRT_XBAR2(XBAR_INPUT, 99)     /* XBAR2_IN99 <- ADC2  ADC_TCOMP_PULSE3 */
#define IMXRT_XBAR2_IN_ADC2_ADC_TCOMP_PULSE4                                    IMXRT_XBAR2(XBAR_INPUT, 100)    /* XBAR2_IN100 <- ADC2  ADC_TCOMP_PULSE4 */
#define IMXRT_XBAR2_IN_ADC2_ADC_TCOMP_PULSE5                                    IMXRT_XBAR2(XBAR_INPUT, 101)    /* XBAR2_IN101 <- ADC2  ADC_TCOMP_PULSE5 */
#define IMXRT_XBAR2_IN_ADC2_ADC_TCOMP_PULSE6                                    IMXRT_XBAR2(XBAR_INPUT, 102)    /* XBAR2_IN102 <- ADC2  ADC_TCOMP_PULSE6 */
#define IMXRT_XBAR2_IN_ADC2_ADC_TCOMP_PULSE7                                    IMXRT_XBAR2(XBAR_INPUT, 103)    /* XBAR2_IN103 <- ADC2  ADC_TCOMP_PULSE7 */
#define IMXRT_XBAR2_IN_TPM1_TPM_CH_TRIGGER0                                     IMXRT_XBAR2(XBAR_INPUT, 104)    /* XBAR2_IN104 <- TPM1  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR2_IN_TPM1_TPM_CH_TRIGGER1                                     IMXRT_XBAR2(XBAR_INPUT, 105)    /* XBAR2_IN105 <- TPM1  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR2_IN_TPM1_TPM_CH_TRIGGER2                                     IMXRT_XBAR2(XBAR_INPUT, 106)    /* XBAR2_IN106 <- TPM1  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR2_IN_TPM1_TPM_CH_TRIGGER3                                     IMXRT_XBAR2(XBAR_INPUT, 107)    /* XBAR2_IN107 <- TPM1  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR2_IN_TPM1_TPM_TRIGGER                                         IMXRT_XBAR2(XBAR_INPUT, 108)    /* XBAR2_IN108 <- TPM1  TPM_TRIGGER */
#define IMXRT_XBAR2_IN_TPM2_TPM_CH_TRIGGER0                                     IMXRT_XBAR2(XBAR_INPUT, 109)    /* XBAR2_IN109 <- TPM2  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR2_IN_TPM2_TPM_CH_TRIGGER1                                     IMXRT_XBAR2(XBAR_INPUT, 110)    /* XBAR2_IN110 <- TPM2  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR2_IN_TPM2_TPM_CH_TRIGGER2                                     IMXRT_XBAR2(XBAR_INPUT, 111)    /* XBAR2_IN111 <- TPM2  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR2_IN_TPM2_TPM_CH_TRIGGER3                                     IMXRT_XBAR2(XBAR_INPUT, 112)    /* XBAR2_IN112 <- TPM2  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR2_IN_TPM2_TPM_TRIGGER                                         IMXRT_XBAR2(XBAR_INPUT, 113)    /* XBAR2_IN113 <- TPM2  TPM_TRIGGER */
#define IMXRT_XBAR2_IN_TPM3_TPM_CH_TRIGGER0                                     IMXRT_XBAR2(XBAR_INPUT, 114)    /* XBAR2_IN114 <- TPM3  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR2_IN_TPM3_TPM_CH_TRIGGER1                                     IMXRT_XBAR2(XBAR_INPUT, 115)    /* XBAR2_IN115 <- TPM3  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR2_IN_TPM3_TPM_CH_TRIGGER2                                     IMXRT_XBAR2(XBAR_INPUT, 116)    /* XBAR2_IN116 <- TPM3  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR2_IN_TPM3_TPM_CH_TRIGGER3                                     IMXRT_XBAR2(XBAR_INPUT, 117)    /* XBAR2_IN117 <- TPM3  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR2_IN_TPM3_TPM_TRIGGER                                         IMXRT_XBAR2(XBAR_INPUT, 118)    /* XBAR2_IN118 <- TPM3  TPM_TRIGGER */
#define IMXRT_XBAR2_IN_TPM4_TPM_CH_TRIGGER0                                     IMXRT_XBAR2(XBAR_INPUT, 119)    /* XBAR2_IN119 <- TPM4  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR2_IN_TPM4_TPM_CH_TRIGGER1                                     IMXRT_XBAR2(XBAR_INPUT, 120)    /* XBAR2_IN120 <- TPM4  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR2_IN_TPM4_TPM_CH_TRIGGER2                                     IMXRT_XBAR2(XBAR_INPUT, 121)    /* XBAR2_IN121 <- TPM4  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR2_IN_TPM4_TPM_CH_TRIGGER3                                     IMXRT_XBAR2(XBAR_INPUT, 122)    /* XBAR2_IN122 <- TPM4  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR2_IN_TPM4_TPM_TRIGGER                                         IMXRT_XBAR2(XBAR_INPUT, 123)    /* XBAR2_IN123 <- TPM4  TPM_TRIGGER */
#define IMXRT_XBAR2_IN_TPM5_TPM_CH_TRIGGER0                                     IMXRT_XBAR2(XBAR_INPUT, 124)    /* XBAR2_IN124 <- TPM5  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR2_IN_TPM5_TPM_CH_TRIGGER1                                     IMXRT_XBAR2(XBAR_INPUT, 125)    /* XBAR2_IN125 <- TPM5  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR2_IN_TPM5_TPM_CH_TRIGGER2                                     IMXRT_XBAR2(XBAR_INPUT, 126)    /* XBAR2_IN126 <- TPM5  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR2_IN_TPM5_TPM_CH_TRIGGER3                                     IMXRT_XBAR2(XBAR_INPUT, 127)    /* XBAR2_IN127 <- TPM5  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR2_IN_TPM5_TPM_TRIGGER                                         IMXRT_XBAR2(XBAR_INPUT, 128)    /* XBAR2_IN128 <- TPM5  TPM_TRIGGER */
#define IMXRT_XBAR2_IN_TPM6_TPM_CH_TRIGGER0                                     IMXRT_XBAR2(XBAR_INPUT, 129)    /* XBAR2_IN129 <- TPM6  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR2_IN_TPM6_TPM_CH_TRIGGER1                                     IMXRT_XBAR2(XBAR_INPUT, 130)    /* XBAR2_IN130 <- TPM6  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR2_IN_TPM6_TPM_CH_TRIGGER2                                     IMXRT_XBAR2(XBAR_INPUT, 131)    /* XBAR2_IN131 <- TPM6  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR2_IN_TPM6_TPM_CH_TRIGGER3                                     IMXRT_XBAR2(XBAR_INPUT, 132)    /* XBAR2_IN132 <- TPM6  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR2_IN_TPM6_TPM_TRIGGER                                         IMXRT_XBAR2(XBAR_INPUT, 133)    /* XBAR2_IN133 <- TPM6  TPM_TRIGGER */
#define IMXRT_XBAR2_IN_LPTMR1_LPTIMER_TRIGGER_DELAY                             IMXRT_XBAR2(XBAR_INPUT, 134)    /* XBAR2_IN134 <- LPTMR1  LPTIMER_TRIGGER_DELAY */
#define IMXRT_XBAR2_IN_LPTMR2_LPTIMER_TRIGGER_DELAY                             IMXRT_XBAR2(XBAR_INPUT, 135)    /* XBAR2_IN135 <- LPTMR2  LPTIMER_TRIGGER_DELAY */
#define IMXRT_XBAR2_IN_LPTMR3_LPTIMER_TRIGGER_DELAY                             IMXRT_XBAR2(XBAR_INPUT, 136)    /* XBAR2_IN136 <- LPTMR3  LPTIMER_TRIGGER_DELAY */
#define IMXRT_XBAR2_IN_NETC_TMR_1588_PP1                                        IMXRT_XBAR2(XBAR_INPUT, 137)    /* XBAR2_IN137 <- NETC  TMR_1588_PP1 */
#define IMXRT_XBAR2_IN_NETC_TMR_1588_PP2                                        IMXRT_XBAR2(XBAR_INPUT, 138)    /* XBAR2_IN138 <- NETC  TMR_1588_PP2 */
#define IMXRT_XBAR2_IN_NETC_TMR_1588_PP3                                        IMXRT_XBAR2(XBAR_INPUT, 139)    /* XBAR2_IN139 <- NETC  TMR_1588_PP3 */
#define IMXRT_XBAR2_IN_SINC1_CHANNEL_0_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR2(XBAR_INPUT, 140)    /* XBAR2_IN140 <- SINC1  Channel 0 break due to clock absence detected */
#define IMXRT_XBAR2_IN_SINC1_CHANNEL_1_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR2(XBAR_INPUT, 141)    /* XBAR2_IN141 <- SINC1  Channel 1 break due to clock absence detected */
#define IMXRT_XBAR2_IN_SINC1_CHANNEL_2_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR2(XBAR_INPUT, 142)    /* XBAR2_IN142 <- SINC1  Channel 2 break due to clock absence detected */
#define IMXRT_XBAR2_IN_SINC1_CHANNEL_3_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR2(XBAR_INPUT, 143)    /* XBAR2_IN143 <- SINC1  Channel 3 break due to clock absence detected */
#define IMXRT_XBAR2_IN_SINC2_CHANNEL_0_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR2(XBAR_INPUT, 144)    /* XBAR2_IN144 <- SINC2  Channel 0 break due to clock absence detected */
#define IMXRT_XBAR2_IN_SINC2_CHANNEL_1_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR2(XBAR_INPUT, 145)    /* XBAR2_IN145 <- SINC2  Channel 1 break due to clock absence detected */
#define IMXRT_XBAR2_IN_SINC2_CHANNEL_2_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR2(XBAR_INPUT, 146)    /* XBAR2_IN146 <- SINC2  Channel 2 break due to clock absence detected */
#define IMXRT_XBAR2_IN_SINC2_CHANNEL_3_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR2(XBAR_INPUT, 147)    /* XBAR2_IN147 <- SINC2  Channel 3 break due to clock absence detected */
#define IMXRT_XBAR2_IN_SINC3_CHANNEL_0_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR2(XBAR_INPUT, 148)    /* XBAR2_IN148 <- SINC3  Channel 0 break due to clock absence detected */
#define IMXRT_XBAR2_IN_SINC3_CHANNEL_1_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR2(XBAR_INPUT, 149)    /* XBAR2_IN149 <- SINC3  Channel 1 break due to clock absence detected */
#define IMXRT_XBAR2_IN_SINC3_CHANNEL_2_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR2(XBAR_INPUT, 150)    /* XBAR2_IN150 <- SINC3  Channel 2 break due to clock absence detected */
#define IMXRT_XBAR2_IN_SINC3_CHANNEL_3_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR2(XBAR_INPUT, 151)    /* XBAR2_IN151 <- SINC3  Channel 3 break due to clock absence detected */
#define IMXRT_XBAR2_IN_RESERVED                                                 IMXRT_XBAR2(XBAR_INPUT, 152)    /* XBAR2_IN152 <- -  Reserved */
