apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_xbar.h
#define IMXRT_XBAR2_IN_RESERVED_2                                               IMXRT_XBAR2(XBAR_INPUT, 153)    /* XBAR2_IN153 <- -  Reserved */
#define IMXRT_XBAR2_IN_RESERVED_3                                               IMXRT_XBAR2(XBAR_INPUT, 154)    /* XBAR2_IN154 <- -  Reserved */
#define IMXRT_XBAR2_IN_RESERVED_4                                               IMXRT_XBAR2(XBAR_INPUT, 155)    /* XBAR2_IN155 <- -  Reserved */
#define IMXRT_XBAR2_IN_EQDC1_POS_MATCH0                                         IMXRT_XBAR2(XBAR_INPUT, 156)    /* XBAR2_IN156 <- eQDC1  POS_MATCH0 */
#define IMXRT_XBAR2_IN_EQDC1_POS_MATCH1                                         IMXRT_XBAR2(XBAR_INPUT, 157)    /* XBAR2_IN157 <- eQDC1  POS_MATCH1 */
#define IMXRT_XBAR2_IN_EQDC1_POS_MATCH2                                         IMXRT_XBAR2(XBAR_INPUT, 158)    /* XBAR2_IN158 <- eQDC1  POS_MATCH2 */
#define IMXRT_XBAR2_IN_EQDC1_POS_MATCH3                                         IMXRT_XBAR2(XBAR_INPUT, 159)    /* XBAR2_IN159 <- eQDC1  POS_MATCH3 */
#define IMXRT_XBAR2_IN_EQDC1_COMP_FLG0                                          IMXRT_XBAR2(XBAR_INPUT, 160)    /* XBAR2_IN160 <- eQDC1  COMP_FLG0 */
#define IMXRT_XBAR2_IN_EQDC1_COMP_FLG1                                          IMXRT_XBAR2(XBAR_INPUT, 161)    /* XBAR2_IN161 <- eQDC1  COMP_FLG1 */
#define IMXRT_XBAR2_IN_EQDC1_COMP_FLG2                                          IMXRT_XBAR2(XBAR_INPUT, 162)    /* XBAR2_IN162 <- eQDC1  COMP_FLG2 */
#define IMXRT_XBAR2_IN_EQDC1_COMP_FLG3                                          IMXRT_XBAR2(XBAR_INPUT, 163)    /* XBAR2_IN163 <- eQDC1  COMP_FLG3 */
#define IMXRT_XBAR2_IN_EQDC1_CNT_DN                                             IMXRT_XBAR2(XBAR_INPUT, 164)    /* XBAR2_IN164 <- eQDC1  CNT_DN */
#define IMXRT_XBAR2_IN_EQDC1_CNT_UP                                             IMXRT_XBAR2(XBAR_INPUT, 165)    /* XBAR2_IN165 <- eQDC1  CNT_UP */
#define IMXRT_XBAR2_IN_EQDC1_DIR                                                IMXRT_XBAR2(XBAR_INPUT, 166)    /* XBAR2_IN166 <- eQDC1  DIR */
#define IMXRT_XBAR2_IN_EQDC3_POS_MATCH0                                         IMXRT_XBAR2(XBAR_INPUT, 167)    /* XBAR2_IN167 <- eQDC3  POS_MATCH0 */
#define IMXRT_XBAR2_IN_EQDC3_POS_MATCH1                                         IMXRT_XBAR2(XBAR_INPUT, 168)    /* XBAR2_IN168 <- eQDC3  POS_MATCH1 */
#define IMXRT_XBAR2_IN_EQDC3_POS_MATCH2                                         IMXRT_XBAR2(XBAR_INPUT, 169)    /* XBAR2_IN169 <- eQDC3  POS_MATCH2 */
#define IMXRT_XBAR2_IN_EQDC3_POS_MATCH3                                         IMXRT_XBAR2(XBAR_INPUT, 170)    /* XBAR2_IN170 <- eQDC3  POS_MATCH3 */
#define IMXRT_XBAR2_IN_EQDC3_COMP_FLG0                                          IMXRT_XBAR2(XBAR_INPUT, 171)    /* XBAR2_IN171 <- eQDC3  COMP_FLG0 */
#define IMXRT_XBAR2_IN_EQDC3_COMP_FLG1                                          IMXRT_XBAR2(XBAR_INPUT, 172)    /* XBAR2_IN172 <- eQDC3  COMP_FLG1 */
#define IMXRT_XBAR2_IN_EQDC3_COMP_FLG2                                          IMXRT_XBAR2(XBAR_INPUT, 173)    /* XBAR2_IN173 <- eQDC3  COMP_FLG2 */
#define IMXRT_XBAR2_IN_EQDC3_COMP_FLG3                                          IMXRT_XBAR2(XBAR_INPUT, 174)    /* XBAR2_IN174 <- eQDC3  COMP_FLG3 */
#define IMXRT_XBAR2_IN_EQDC3_CNT_DN                                             IMXRT_XBAR2(XBAR_INPUT, 175)    /* XBAR2_IN175 <- eQDC3  CNT_DN */
#define IMXRT_XBAR2_IN_EQDC3_CNT_UP                                             IMXRT_XBAR2(XBAR_INPUT, 176)    /* XBAR2_IN176 <- eQDC3  CNT_UP */
#define IMXRT_XBAR2_IN_EQDC3_DIR                                                IMXRT_XBAR2(XBAR_INPUT, 177)    /* XBAR2_IN177 <- eQDC3  DIR */

#define IMXRT_XBAR3_IN_GND                                                      IMXRT_XBAR3(XBAR_INPUT, 0)      /* XBAR3_IN0 <- -  GND */
#define IMXRT_XBAR3_IN_1B1                                                      IMXRT_XBAR3(XBAR_INPUT, 1)      /* XBAR3_IN1 <- -  1'B1 */
#define IMXRT_XBAR3_IN_GND_2                                                    IMXRT_XBAR3(XBAR_INPUT, 2)      /* XBAR3_IN2 <- -  GND */
#define IMXRT_XBAR3_IN_1B1_2                                                    IMXRT_XBAR3(XBAR_INPUT, 3)      /* XBAR3_IN3 <- -  1'B1 */
#define IMXRT_XBAR3_IN_CMP1_COUT                                                IMXRT_XBAR3(XBAR_INPUT, 4)      /* XBAR3_IN4 <- CMP1  COUT */
#define IMXRT_XBAR3_IN_CMP2_COUT                                                IMXRT_XBAR3(XBAR_INPUT, 5)      /* XBAR3_IN5 <- CMP2  COUT */
#define IMXRT_XBAR3_IN_CMP3_COUT                                                IMXRT_XBAR3(XBAR_INPUT, 6)      /* XBAR3_IN6 <- CMP3  COUT */
#define IMXRT_XBAR3_IN_CMP4_COUT                                                IMXRT_XBAR3(XBAR_INPUT, 7)      /* XBAR3_IN7 <- CMP4  COUT */
#define IMXRT_XBAR3_IN_TMR1_TMR0_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 8)      /* XBAR3_IN8 <- TMR1  TMR0_OUTPUT */
#define IMXRT_XBAR3_IN_TMR1_TMR1_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 9)      /* XBAR3_IN9 <- TMR1  TMR1_OUTPUT */
#define IMXRT_XBAR3_IN_TMR1_TMR2_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 10)     /* XBAR3_IN10 <- TMR1  TMR2_OUTPUT */
#define IMXRT_XBAR3_IN_TMR1_TMR3_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 11)     /* XBAR3_IN11 <- TMR1  TMR3_OUTPUT */
#define IMXRT_XBAR3_IN_TMR2_TMR0_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 12)     /* XBAR3_IN12 <- TMR2  TMR0_OUTPUT */
#define IMXRT_XBAR3_IN_TMR2_TMR1_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 13)     /* XBAR3_IN13 <- TMR2  TMR1_OUTPUT */
#define IMXRT_XBAR3_IN_TMR2_TMR2_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 14)     /* XBAR3_IN14 <- TMR2  TMR2_OUTPUT */
#define IMXRT_XBAR3_IN_TMR2_TMR3_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 15)     /* XBAR3_IN15 <- TMR2  TMR3_OUTPUT */
#define IMXRT_XBAR3_IN_TMR3_TMR0_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 16)     /* XBAR3_IN16 <- TMR3  TMR0_OUTPUT */
#define IMXRT_XBAR3_IN_TMR3_TMR1_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 17)     /* XBAR3_IN17 <- TMR3  TMR1_OUTPUT */
#define IMXRT_XBAR3_IN_TMR3_TMR2_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 18)     /* XBAR3_IN18 <- TMR3  TMR2_OUTPUT */
#define IMXRT_XBAR3_IN_TMR3_TMR3_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 19)     /* XBAR3_IN19 <- TMR3  TMR3_OUTPUT */
#define IMXRT_XBAR3_IN_TMR4_TMR0_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 20)     /* XBAR3_IN20 <- TMR4  TMR0_OUTPUT */
#define IMXRT_XBAR3_IN_TMR4_TMR1_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 21)     /* XBAR3_IN21 <- TMR4  TMR1_OUTPUT */
#define IMXRT_XBAR3_IN_TMR4_TMR2_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 22)     /* XBAR3_IN22 <- TMR4  TMR2_OUTPUT */
#define IMXRT_XBAR3_IN_TMR4_TMR3_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 23)     /* XBAR3_IN23 <- TMR4  TMR3_OUTPUT */
#define IMXRT_XBAR3_IN_TMR5_TMR0_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 24)     /* XBAR3_IN24 <- TMR5  TMR0_OUTPUT */
#define IMXRT_XBAR3_IN_TMR5_TMR1_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 25)     /* XBAR3_IN25 <- TMR5  TMR1_OUTPUT */
#define IMXRT_XBAR3_IN_TMR5_TMR2_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 26)     /* XBAR3_IN26 <- TMR5  TMR2_OUTPUT */
#define IMXRT_XBAR3_IN_TMR5_TMR3_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 27)     /* XBAR3_IN27 <- TMR5  TMR3_OUTPUT */
#define IMXRT_XBAR3_IN_TMR6_TMR0_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 28)     /* XBAR3_IN28 <- TMR6  TMR0_OUTPUT */
#define IMXRT_XBAR3_IN_TMR6_TMR1_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 29)     /* XBAR3_IN29 <- TMR6  TMR1_OUTPUT */
#define IMXRT_XBAR3_IN_TMR6_TMR2_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 30)     /* XBAR3_IN30 <- TMR6  TMR2_OUTPUT */
#define IMXRT_XBAR3_IN_TMR6_TMR3_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 31)     /* XBAR3_IN31 <- TMR6  TMR3_OUTPUT */
#define IMXRT_XBAR3_IN_TMR7_TMR0_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 32)     /* XBAR3_IN32 <- TMR7  TMR0_OUTPUT */
#define IMXRT_XBAR3_IN_TMR7_TMR1_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 33)     /* XBAR3_IN33 <- TMR7  TMR1_OUTPUT */
#define IMXRT_XBAR3_IN_TMR7_TMR2_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 34)     /* XBAR3_IN34 <- TMR7  TMR2_OUTPUT */
#define IMXRT_XBAR3_IN_TMR7_TMR3_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 35)     /* XBAR3_IN35 <- TMR7  TMR3_OUTPUT */
#define IMXRT_XBAR3_IN_TMR8_TMR0_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 36)     /* XBAR3_IN36 <- TMR8  TMR0_OUTPUT */
#define IMXRT_XBAR3_IN_TMR8_TMR1_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 37)     /* XBAR3_IN37 <- TMR8  TMR1_OUTPUT */
#define IMXRT_XBAR3_IN_TMR8_TMR2_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 38)     /* XBAR3_IN38 <- TMR8  TMR2_OUTPUT */
#define IMXRT_XBAR3_IN_TMR8_TMR3_OUTPUT                                         IMXRT_XBAR3(XBAR_INPUT, 39)     /* XBAR3_IN39 <- TMR8  TMR3_OUTPUT */
#define IMXRT_XBAR3_IN_FLEXPWM1_PWM0_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 40)     /* XBAR3_IN40 <- FLEXPWM1  PWM0_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM1_PWM1_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 41)     /* XBAR3_IN41 <- FLEXPWM1  PWM1_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM1_PWM2_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 42)     /* XBAR3_IN42 <- FLEXPWM1  PWM2_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM1_PWM3_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 43)     /* XBAR3_IN43 <- FLEXPWM1  PWM3_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM2_PWM0_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 44)     /* XBAR3_IN44 <- FLEXPWM2  PWM0_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM2_PWM1_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 45)     /* XBAR3_IN45 <- FLEXPWM2  PWM1_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM2_PWM2_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 46)     /* XBAR3_IN46 <- FLEXPWM2  PWM2_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM2_PWM3_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 47)     /* XBAR3_IN47 <- FLEXPWM2  PWM3_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM3_PWM0_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 48)     /* XBAR3_IN48 <- FLEXPWM3  PWM0_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM3_PWM1_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 49)     /* XBAR3_IN49 <- FLEXPWM3  PWM1_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM3_PWM2_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 50)     /* XBAR3_IN50 <- FLEXPWM3  PWM2_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM3_PWM3_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 51)     /* XBAR3_IN51 <- FLEXPWM3  PWM3_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM4_PWM0_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 52)     /* XBAR3_IN52 <- FLEXPWM4  PWM0_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM4_PWM1_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 53)     /* XBAR3_IN53 <- FLEXPWM4  PWM1_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM4_PWM2_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 54)     /* XBAR3_IN54 <- FLEXPWM4  PWM2_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_FLEXPWM4_PWM3_MUX_TRIGGER0                               IMXRT_XBAR3(XBAR_INPUT, 55)     /* XBAR3_IN55 <- FLEXPWM4  PWM3_MUX_TRIGGER0 */
#define IMXRT_XBAR3_IN_LPIT1_LPIT_TRIG_OUT0                                     IMXRT_XBAR3(XBAR_INPUT, 56)     /* XBAR3_IN56 <- LPIT1  LPIT_TRIG_OUT0 */
#define IMXRT_XBAR3_IN_LPIT1_LPIT_TRIG_OUT1                                     IMXRT_XBAR3(XBAR_INPUT, 57)     /* XBAR3_IN57 <- LPIT1  LPIT_TRIG_OUT1 */
#define IMXRT_XBAR3_IN_LPIT1_LPIT_TRIG_OUT2                                     IMXRT_XBAR3(XBAR_INPUT, 58)     /* XBAR3_IN58 <- LPIT1  LPIT_TRIG_OUT2 */
#define IMXRT_XBAR3_IN_LPIT1_LPIT_TRIG_OUT3                                     IMXRT_XBAR3(XBAR_INPUT, 59)     /* XBAR3_IN59 <- LPIT1  LPIT_TRIG_OUT3 */
#define IMXRT_XBAR3_IN_LPIT2_LPIT_TRIG_OUT0                                     IMXRT_XBAR3(XBAR_INPUT, 60)     /* XBAR3_IN60 <- LPIT2  LPIT_TRIG_OUT0 */
#define IMXRT_XBAR3_IN_LPIT2_LPIT_TRIG_OUT1                                     IMXRT_XBAR3(XBAR_INPUT, 61)     /* XBAR3_IN61 <- LPIT2  LPIT_TRIG_OUT1 */
#define IMXRT_XBAR3_IN_LPIT2_LPIT_TRIG_OUT2                                     IMXRT_XBAR3(XBAR_INPUT, 62)     /* XBAR3_IN62 <- LPIT2  LPIT_TRIG_OUT2 */
#define IMXRT_XBAR3_IN_LPIT2_LPIT_TRIG_OUT3                                     IMXRT_XBAR3(XBAR_INPUT, 63)     /* XBAR3_IN63 <- LPIT2  LPIT_TRIG_OUT3 */
#define IMXRT_XBAR3_IN_LPIT3_LPIT_TRIG_OUT0                                     IMXRT_XBAR3(XBAR_INPUT, 64)     /* XBAR3_IN64 <- LPIT3  LPIT_TRIG_OUT0 */
#define IMXRT_XBAR3_IN_LPIT3_LPIT_TRIG_OUT1                                     IMXRT_XBAR3(XBAR_INPUT, 65)     /* XBAR3_IN65 <- LPIT3  LPIT_TRIG_OUT1 */
#define IMXRT_XBAR3_IN_LPIT3_LPIT_TRIG_OUT2                                     IMXRT_XBAR3(XBAR_INPUT, 66)     /* XBAR3_IN66 <- LPIT3  LPIT_TRIG_OUT2 */
#define IMXRT_XBAR3_IN_LPIT3_LPIT_TRIG_OUT3                                     IMXRT_XBAR3(XBAR_INPUT, 67)     /* XBAR3_IN67 <- LPIT3  LPIT_TRIG_OUT3 */
#define IMXRT_XBAR3_IN_SINC2_PULSE_TRG0                                         IMXRT_XBAR3(XBAR_INPUT, 68)     /* XBAR3_IN68 <- SINC2  PULSE_TRG0 */
#define IMXRT_XBAR3_IN_SINC2_PULSE_TRG1                                         IMXRT_XBAR3(XBAR_INPUT, 69)     /* XBAR3_IN69 <- SINC2  PULSE_TRG1 */
#define IMXRT_XBAR3_IN_SINC2_PULSE_TRG2                                         IMXRT_XBAR3(XBAR_INPUT, 70)     /* XBAR3_IN70 <- SINC2  PULSE_TRG2 */
#define IMXRT_XBAR3_IN_SINC2_PULSE_TRG3                                         IMXRT_XBAR3(XBAR_INPUT, 71)     /* XBAR3_IN71 <- SINC2  PULSE_TRG3 */
#define IMXRT_XBAR3_IN_EDMA4_DMA_TRIGGER_OUT0                                   IMXRT_XBAR3(XBAR_INPUT, 72)     /* XBAR3_IN72 <- eDMA4  DMA_TRIGGER_OUT0 */
#define IMXRT_XBAR3_IN_EDMA4_DMA_TRIGGER_OUT1                                   IMXRT_XBAR3(XBAR_INPUT, 73)     /* XBAR3_IN73 <- eDMA4  DMA_TRIGGER_OUT1 */
#define IMXRT_XBAR3_IN_EDMA4_DMA_TRIGGER_OUT2                                   IMXRT_XBAR3(XBAR_INPUT, 74)     /* XBAR3_IN74 <- eDMA4  DMA_TRIGGER_OUT2 */
#define IMXRT_XBAR3_IN_EDMA4_DMA_TRIGGER_OUT3                                   IMXRT_XBAR3(XBAR_INPUT, 75)     /* XBAR3_IN75 <- eDMA4  DMA_TRIGGER_OUT3 */
#define IMXRT_XBAR3_IN_EDMA4_DMA_TRIGGER_OUT4                                   IMXRT_XBAR3(XBAR_INPUT, 76)     /* XBAR3_IN76 <- eDMA4  DMA_TRIGGER_OUT4 */
#define IMXRT_XBAR3_IN_EDMA4_DMA_TRIGGER_OUT5                                   IMXRT_XBAR3(XBAR_INPUT, 77)     /* XBAR3_IN77 <- eDMA4  DMA_TRIGGER_OUT5 */
#define IMXRT_XBAR3_IN_EDMA4_DMA_TRIGGER_OUT6                                   IMXRT_XBAR3(XBAR_INPUT, 78)     /* XBAR3_IN78 <- eDMA4  DMA_TRIGGER_OUT6 */
#define IMXRT_XBAR3_IN_EDMA4_DMA_TRIGGER_OUT7                                   IMXRT_XBAR3(XBAR_INPUT, 79)     /* XBAR3_IN79 <- eDMA4  DMA_TRIGGER_OUT7 */
#define IMXRT_XBAR3_IN_EDMA3_DMA_TRIGGER_OUT0                                   IMXRT_XBAR3(XBAR_INPUT, 80)     /* XBAR3_IN80 <- eDMA3  DMA_TRIGGER_OUT0 */
#define IMXRT_XBAR3_IN_EDMA3_DMA_TRIGGER_OUT1                                   IMXRT_XBAR3(XBAR_INPUT, 81)     /* XBAR3_IN81 <- eDMA3  DMA_TRIGGER_OUT1 */
#define IMXRT_XBAR3_IN_EDMA3_DMA_TRIGGER_OUT2                                   IMXRT_XBAR3(XBAR_INPUT, 82)     /* XBAR3_IN82 <- eDMA3  DMA_TRIGGER_OUT2 */
#define IMXRT_XBAR3_IN_EDMA3_DMA_TRIGGER_OUT3                                   IMXRT_XBAR3(XBAR_INPUT, 83)     /* XBAR3_IN83 <- eDMA3  DMA_TRIGGER_OUT3 */
#define IMXRT_XBAR3_IN_EDMA3_DMA_TRIGGER_OUT4                                   IMXRT_XBAR3(XBAR_INPUT, 84)     /* XBAR3_IN84 <- eDMA3  DMA_TRIGGER_OUT4 */
#define IMXRT_XBAR3_IN_EDMA3_DMA_TRIGGER_OUT5                                   IMXRT_XBAR3(XBAR_INPUT, 85)     /* XBAR3_IN85 <- eDMA3  DMA_TRIGGER_OUT5 */
#define IMXRT_XBAR3_IN_EDMA3_DMA_TRIGGER_OUT6                                   IMXRT_XBAR3(XBAR_INPUT, 86)     /* XBAR3_IN86 <- eDMA3  DMA_TRIGGER_OUT6 */
#define IMXRT_XBAR3_IN_EDMA3_DMA_TRIGGER_OUT7                                   IMXRT_XBAR3(XBAR_INPUT, 87)     /* XBAR3_IN87 <- eDMA3  DMA_TRIGGER_OUT7 */
#define IMXRT_XBAR3_IN_ADC1_ADC_TCOMP_PULSE0                                    IMXRT_XBAR3(XBAR_INPUT, 88)     /* XBAR3_IN88 <- ADC1  ADC_TCOMP_PULSE0 */
#define IMXRT_XBAR3_IN_ADC1_ADC_TCOMP_PULSE1                                    IMXRT_XBAR3(XBAR_INPUT, 89)     /* XBAR3_IN89 <- ADC1  ADC_TCOMP_PULSE1 */
#define IMXRT_XBAR3_IN_ADC1_ADC_TCOMP_PULSE2                                    IMXRT_XBAR3(XBAR_INPUT, 90)     /* XBAR3_IN90 <- ADC1  ADC_TCOMP_PULSE2 */
#define IMXRT_XBAR3_IN_ADC1_ADC_TCOMP_PULSE3                                    IMXRT_XBAR3(XBAR_INPUT, 91)     /* XBAR3_IN91 <- ADC1  ADC_TCOMP_PULSE3 */
#define IMXRT_XBAR3_IN_ADC1_ADC_TCOMP_PULSE4                                    IMXRT_XBAR3(XBAR_INPUT, 92)     /* XBAR3_IN92 <- ADC1  ADC_TCOMP_PULSE4 */
#define IMXRT_XBAR3_IN_ADC1_ADC_TCOMP_PULSE5                                    IMXRT_XBAR3(XBAR_INPUT, 93)     /* XBAR3_IN93 <- ADC1  ADC_TCOMP_PULSE5 */
#define IMXRT_XBAR3_IN_ADC1_ADC_TCOMP_PULSE6                                    IMXRT_XBAR3(XBAR_INPUT, 94)     /* XBAR3_IN94 <- ADC1  ADC_TCOMP_PULSE6 */
#define IMXRT_XBAR3_IN_ADC1_ADC_TCOMP_PULSE7                                    IMXRT_XBAR3(XBAR_INPUT, 95)     /* XBAR3_IN95 <- ADC1  ADC_TCOMP_PULSE7 */
#define IMXRT_XBAR3_IN_ADC2_ADC_TCOMP_PULSE0                                    IMXRT_XBAR3(XBAR_INPUT, 96)     /* XBAR3_IN96 <- ADC2  ADC_TCOMP_PULSE0 */
#define IMXRT_XBAR3_IN_ADC2_ADC_TCOMP_PULSE1                                    IMXRT_XBAR3(XBAR_INPUT, 97)     /* XBAR3_IN97 <- ADC2  ADC_TCOMP_PULSE1 */
#define IMXRT_XBAR3_IN_ADC2_ADC_TCOMP_PULSE2                                    IMXRT_XBAR3(XBAR_INPUT, 98)     /* XBAR3_IN98 <- ADC2  ADC_TCOMP_PULSE2 */
#define IMXRT_XBAR3_IN_ADC2_ADC_TCOMP_PULSE3                                    IMXRT_XBAR3(XBAR_INPUT, 99)     /* XBAR3_IN99 <- ADC2  ADC_TCOMP_PULSE3 */
#define IMXRT_XBAR3_IN_ADC2_ADC_TCOMP_PULSE4                                    IMXRT_XBAR3(XBAR_INPUT, 100)    /* XBAR3_IN100 <- ADC2  ADC_TCOMP_PULSE4 */
#define IMXRT_XBAR3_IN_ADC2_ADC_TCOMP_PULSE5                                    IMXRT_XBAR3(XBAR_INPUT, 101)    /* XBAR3_IN101 <- ADC2  ADC_TCOMP_PULSE5 */
#define IMXRT_XBAR3_IN_ADC2_ADC_TCOMP_PULSE6                                    IMXRT_XBAR3(XBAR_INPUT, 102)    /* XBAR3_IN102 <- ADC2  ADC_TCOMP_PULSE6 */
#define IMXRT_XBAR3_IN_ADC2_ADC_TCOMP_PULSE7                                    IMXRT_XBAR3(XBAR_INPUT, 103)    /* XBAR3_IN103 <- ADC2  ADC_TCOMP_PULSE7 */
#define IMXRT_XBAR3_IN_TPM1_TPM_CH_TRIGGER0                                     IMXRT_XBAR3(XBAR_INPUT, 104)    /* XBAR3_IN104 <- TPM1  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR3_IN_TPM1_TPM_CH_TRIGGER1                                     IMXRT_XBAR3(XBAR_INPUT, 105)    /* XBAR3_IN105 <- TPM1  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR3_IN_TPM1_TPM_CH_TRIGGER2                                     IMXRT_XBAR3(XBAR_INPUT, 106)    /* XBAR3_IN106 <- TPM1  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR3_IN_TPM1_TPM_CH_TRIGGER3                                     IMXRT_XBAR3(XBAR_INPUT, 107)    /* XBAR3_IN107 <- TPM1  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR3_IN_TPM1_TPM_TRIGGER                                         IMXRT_XBAR3(XBAR_INPUT, 108)    /* XBAR3_IN108 <- TPM1  TPM_TRIGGER */
#define IMXRT_XBAR3_IN_TPM2_TPM_CH_TRIGGER0                                     IMXRT_XBAR3(XBAR_INPUT, 109)    /* XBAR3_IN109 <- TPM2  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR3_IN_TPM2_TPM_CH_TRIGGER1                                     IMXRT_XBAR3(XBAR_INPUT, 110)    /* XBAR3_IN110 <- TPM2  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR3_IN_TPM2_TPM_CH_TRIGGER2                                     IMXRT_XBAR3(XBAR_INPUT, 111)    /* XBAR3_IN111 <- TPM2  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR3_IN_TPM2_TPM_CH_TRIGGER3                                     IMXRT_XBAR3(XBAR_INPUT, 112)    /* XBAR3_IN112 <- TPM2  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR3_IN_TPM2_TPM_TRIGGER                                         IMXRT_XBAR3(XBAR_INPUT, 113)    /* XBAR3_IN113 <- TPM2  TPM_TRIGGER */
#define IMXRT_XBAR3_IN_TPM3_TPM_CH_TRIGGER0                                     IMXRT_XBAR3(XBAR_INPUT, 114)    /* XBAR3_IN114 <- TPM3  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR3_IN_TPM3_TPM_CH_TRIGGER1                                     IMXRT_XBAR3(XBAR_INPUT, 115)    /* XBAR3_IN115 <- TPM3  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR3_IN_TPM3_TPM_CH_TRIGGER2                                     IMXRT_XBAR3(XBAR_INPUT, 116)    /* XBAR3_IN116 <- TPM3  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR3_IN_TPM3_TPM_CH_TRIGGER3                                     IMXRT_XBAR3(XBAR_INPUT, 117)    /* XBAR3_IN117 <- TPM3  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR3_IN_TPM3_TPM_TRIGGER                                         IMXRT_XBAR3(XBAR_INPUT, 118)    /* XBAR3_IN118 <- TPM3  TPM_TRIGGER */
#define IMXRT_XBAR3_IN_TPM4_TPM_CH_TRIGGER0                                     IMXRT_XBAR3(XBAR_INPUT, 119)    /* XBAR3_IN119 <- TPM4  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR3_IN_TPM4_TPM_CH_TRIGGER1                                     IMXRT_XBAR3(XBAR_INPUT, 120)    /* XBAR3_IN120 <- TPM4  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR3_IN_TPM4_TPM_CH_TRIGGER2                                     IMXRT_XBAR3(XBAR_INPUT, 121)    /* XBAR3_IN121 <- TPM4  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR3_IN_TPM4_TPM_CH_TRIGGER3                                     IMXRT_XBAR3(XBAR_INPUT, 122)    /* XBAR3_IN122 <- TPM4  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR3_IN_TPM4_TPM_TRIGGER                                         IMXRT_XBAR3(XBAR_INPUT, 123)    /* XBAR3_IN123 <- TPM4  TPM_TRIGGER */
#define IMXRT_XBAR3_IN_TPM5_TPM_CH_TRIGGER0                                     IMXRT_XBAR3(XBAR_INPUT, 124)    /* XBAR3_IN124 <- TPM5  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR3_IN_TPM5_TPM_CH_TRIGGER1                                     IMXRT_XBAR3(XBAR_INPUT, 125)    /* XBAR3_IN125 <- TPM5  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR3_IN_TPM5_TPM_CH_TRIGGER2                                     IMXRT_XBAR3(XBAR_INPUT, 126)    /* XBAR3_IN126 <- TPM5  TPM_CH_TRIGGER2 */
#define IMXRT_XBAR3_IN_TPM5_TPM_CH_TRIGGER3                                     IMXRT_XBAR3(XBAR_INPUT, 127)    /* XBAR3_IN127 <- TPM5  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR3_IN_TPM5_TPM_TRIGGER                                         IMXRT_XBAR3(XBAR_INPUT, 128)    /* XBAR3_IN128 <- TPM5  TPM_TRIGGER */
#define IMXRT_XBAR3_IN_TPM6_TPM_CH_TRIGGER0                                     IMXRT_XBAR3(XBAR_INPUT, 129)    /* XBAR3_IN129 <- TPM6  TPM_CH_TRIGGER0 */
#define IMXRT_XBAR3_IN_TPM6_TPM_CH_TRIGGER1                                     IMXRT_XBAR3(XBAR_INPUT, 130)    /* XBAR3_IN130 <- TPM6  TPM_CH_TRIGGER1 */
#define IMXRT_XBAR3_IN_TPM6_TPM_CH_TRIGGER2                                     IMXRT_XBAR3(XBAR_INPUT, 131)    /* XBAR3_IN131 <- TPM6  TPM_CH_TRIGGER2 */
