apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_xbar.h
#define IMXRT_XBAR3_IN_TPM6_TPM_CH_TRIGGER3                                     IMXRT_XBAR3(XBAR_INPUT, 132)    /* XBAR3_IN132 <- TPM6  TPM_CH_TRIGGER3 */
#define IMXRT_XBAR3_IN_TPM6_TPM_TRIGGER                                         IMXRT_XBAR3(XBAR_INPUT, 133)    /* XBAR3_IN133 <- TPM6  TPM_TRIGGER */
#define IMXRT_XBAR3_IN_LPTMR1_LPTIMER_TRIGGER_DELAY                             IMXRT_XBAR3(XBAR_INPUT, 134)    /* XBAR3_IN134 <- LPTMR1  LPTIMER_TRIGGER_DELAY */
#define IMXRT_XBAR3_IN_LPTMR2_LPTIMER_TRIGGER_DELAY                             IMXRT_XBAR3(XBAR_INPUT, 135)    /* XBAR3_IN135 <- LPTMR2  LPTIMER_TRIGGER_DELAY */
#define IMXRT_XBAR3_IN_LPTMR3_LPTIMER_TRIGGER_DELAY                             IMXRT_XBAR3(XBAR_INPUT, 136)    /* XBAR3_IN136 <- LPTMR3  LPTIMER_TRIGGER_DELAY */
#define IMXRT_XBAR3_IN_NETC_TMR_1588_PP1                                        IMXRT_XBAR3(XBAR_INPUT, 137)    /* XBAR3_IN137 <- NETC  TMR_1588_PP1 */
#define IMXRT_XBAR3_IN_NETC_TMR_1588_PP2                                        IMXRT_XBAR3(XBAR_INPUT, 138)    /* XBAR3_IN138 <- NETC  TMR_1588_PP2 */
#define IMXRT_XBAR3_IN_NETC_TMR_1588_PP3                                        IMXRT_XBAR3(XBAR_INPUT, 139)    /* XBAR3_IN139 <- NETC  TMR_1588_PP3 */
#define IMXRT_XBAR3_IN_SINC1_CHANNEL_0_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR3(XBAR_INPUT, 140)    /* XBAR3_IN140 <- SINC1  Channel 0 break due to clock absence detected */
#define IMXRT_XBAR3_IN_SINC1_CHANNEL_1_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR3(XBAR_INPUT, 141)    /* XBAR3_IN141 <- SINC1  Channel 1 break due to clock absence detected */
#define IMXRT_XBAR3_IN_SINC1_CHANNEL_2_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR3(XBAR_INPUT, 142)    /* XBAR3_IN142 <- SINC1  Channel 2 break due to clock absence detected */
#define IMXRT_XBAR3_IN_SINC1_CHANNEL_3_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR3(XBAR_INPUT, 143)    /* XBAR3_IN143 <- SINC1  Channel 3 break due to clock absence detected */
#define IMXRT_XBAR3_IN_SINC2_CHANNEL_0_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR3(XBAR_INPUT, 144)    /* XBAR3_IN144 <- SINC2  Channel 0 break due to clock absence detected */
#define IMXRT_XBAR3_IN_SINC2_CHANNEL_1_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR3(XBAR_INPUT, 145)    /* XBAR3_IN145 <- SINC2  Channel 1 break due to clock absence detected */
#define IMXRT_XBAR3_IN_SINC2_CHANNEL_2_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR3(XBAR_INPUT, 146)    /* XBAR3_IN146 <- SINC2  Channel 2 break due to clock absence detected */
#define IMXRT_XBAR3_IN_SINC2_CHANNEL_3_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR3(XBAR_INPUT, 147)    /* XBAR3_IN147 <- SINC2  Channel 3 break due to clock absence detected */
#define IMXRT_XBAR3_IN_SINC3_CHANNEL_0_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR3(XBAR_INPUT, 148)    /* XBAR3_IN148 <- SINC3  Channel 0 break due to clock absence detected */
#define IMXRT_XBAR3_IN_SINC3_CHANNEL_1_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR3(XBAR_INPUT, 149)    /* XBAR3_IN149 <- SINC3  Channel 1 break due to clock absence detected */
#define IMXRT_XBAR3_IN_SINC3_CHANNEL_2_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR3(XBAR_INPUT, 150)    /* XBAR3_IN150 <- SINC3  Channel 2 break due to clock absence detected */
#define IMXRT_XBAR3_IN_SINC3_CHANNEL_3_BREAK_DUE_TO_CLOCK_ABSENCE_DETECTED      IMXRT_XBAR3(XBAR_INPUT, 151)    /* XBAR3_IN151 <- SINC3  Channel 3 break due to clock absence detected */
#define IMXRT_XBAR3_IN_RESERVED                                                 IMXRT_XBAR3(XBAR_INPUT, 152)    /* XBAR3_IN152 <- -  Reserved */
#define IMXRT_XBAR3_IN_RESERVED_2                                               IMXRT_XBAR3(XBAR_INPUT, 153)    /* XBAR3_IN153 <- -  Reserved */
#define IMXRT_XBAR3_IN_RESERVED_3                                               IMXRT_XBAR3(XBAR_INPUT, 154)    /* XBAR3_IN154 <- -  Reserved */
#define IMXRT_XBAR3_IN_RESERVED_4                                               IMXRT_XBAR3(XBAR_INPUT, 155)    /* XBAR3_IN155 <- -  Reserved */
#define IMXRT_XBAR3_IN_EQDC2_POS_MATCH0                                         IMXRT_XBAR3(XBAR_INPUT, 156)    /* XBAR3_IN156 <- eQDC2  POS_MATCH0 */
#define IMXRT_XBAR3_IN_EQDC2_POS_MATCH1                                         IMXRT_XBAR3(XBAR_INPUT, 157)    /* XBAR3_IN157 <- eQDC2  POS_MATCH1 */
#define IMXRT_XBAR3_IN_EQDC2_POS_MATCH2                                         IMXRT_XBAR3(XBAR_INPUT, 158)    /* XBAR3_IN158 <- eQDC2  POS_MATCH2 */
#define IMXRT_XBAR3_IN_EQDC2_POS_MATCH3                                         IMXRT_XBAR3(XBAR_INPUT, 159)    /* XBAR3_IN159 <- eQDC2  POS_MATCH3 */
#define IMXRT_XBAR3_IN_EQDC2_COMP_FLG0                                          IMXRT_XBAR3(XBAR_INPUT, 160)    /* XBAR3_IN160 <- eQDC2  COMP_FLG0 */
#define IMXRT_XBAR3_IN_EQDC2_COMP_FLG1                                          IMXRT_XBAR3(XBAR_INPUT, 161)    /* XBAR3_IN161 <- eQDC2  COMP_FLG1 */
#define IMXRT_XBAR3_IN_EQDC2_COMP_FLG2                                          IMXRT_XBAR3(XBAR_INPUT, 162)    /* XBAR3_IN162 <- eQDC2  COMP_FLG2 */
#define IMXRT_XBAR3_IN_EQDC2_COMP_FLG3                                          IMXRT_XBAR3(XBAR_INPUT, 163)    /* XBAR3_IN163 <- eQDC2  COMP_FLG3 */
#define IMXRT_XBAR3_IN_EQDC2_CNT_DN                                             IMXRT_XBAR3(XBAR_INPUT, 164)    /* XBAR3_IN164 <- eQDC2  CNT_DN */
#define IMXRT_XBAR3_IN_EQDC2_CNT_UP                                             IMXRT_XBAR3(XBAR_INPUT, 165)    /* XBAR3_IN165 <- eQDC2  CNT_UP */
#define IMXRT_XBAR3_IN_EQDC2_DIR                                                IMXRT_XBAR3(XBAR_INPUT, 166)    /* XBAR3_IN166 <- eQDC2  DIR */
#define IMXRT_XBAR3_IN_EQDC4_POS_MATCH0                                         IMXRT_XBAR3(XBAR_INPUT, 167)    /* XBAR3_IN167 <- eQDC4  POS_MATCH0 */
#define IMXRT_XBAR3_IN_EQDC4_POS_MATCH1                                         IMXRT_XBAR3(XBAR_INPUT, 168)    /* XBAR3_IN168 <- eQDC4  POS_MATCH1 */
#define IMXRT_XBAR3_IN_EQDC4_POS_MATCH2                                         IMXRT_XBAR3(XBAR_INPUT, 169)    /* XBAR3_IN169 <- eQDC4  POS_MATCH2 */
#define IMXRT_XBAR3_IN_EQDC4_POS_MATCH3                                         IMXRT_XBAR3(XBAR_INPUT, 170)    /* XBAR3_IN170 <- eQDC4  POS_MATCH3 */
#define IMXRT_XBAR3_IN_EQDC4_COMP_FLG0                                          IMXRT_XBAR3(XBAR_INPUT, 171)    /* XBAR3_IN171 <- eQDC4  COMP_FLG0 */
#define IMXRT_XBAR3_IN_EQDC4_COMP_FLG1                                          IMXRT_XBAR3(XBAR_INPUT, 172)    /* XBAR3_IN172 <- eQDC4  COMP_FLG1 */
#define IMXRT_XBAR3_IN_EQDC4_COMP_FLG2                                          IMXRT_XBAR3(XBAR_INPUT, 173)    /* XBAR3_IN173 <- eQDC4  COMP_FLG2 */
#define IMXRT_XBAR3_IN_EQDC4_COMP_FLG3                                          IMXRT_XBAR3(XBAR_INPUT, 174)    /* XBAR3_IN174 <- eQDC4  COMP_FLG3 */
#define IMXRT_XBAR3_IN_EQDC4_CNT_DN                                             IMXRT_XBAR3(XBAR_INPUT, 175)    /* XBAR3_IN175 <- eQDC4  CNT_DN */
#define IMXRT_XBAR3_IN_EQDC4_CNT_UP                                             IMXRT_XBAR3(XBAR_INPUT, 176)    /* XBAR3_IN176 <- eQDC4  CNT_UP */
#define IMXRT_XBAR3_IN_EQDC4_DIR                                                IMXRT_XBAR3(XBAR_INPUT, 177)    /* XBAR3_IN177 <- eQDC4  DIR */

/****************************************************************************
 * XBAR Output Assignments (IMXRT1180RM Table 15)
 ****************************************************************************/

