apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_xbar.h
#define IMXRT_XBAR1_OUT_EDMA4_DMA_MUX_REQ154            IMXRT_XBAR1(XBAR_OUTPUT, 0)     /* XBAR1_OUT0 -> eDMA4  DMA_MUX_REQ154 */
#define IMXRT_XBAR1_OUT_EDMA4_DMA_MUX_REQ155            IMXRT_XBAR1(XBAR_OUTPUT, 1)     /* XBAR1_OUT1 -> eDMA4  DMA_MUX_REQ155 */
#define IMXRT_XBAR1_OUT_EDMA4_DMA_MUX_REQ156            IMXRT_XBAR1(XBAR_OUTPUT, 2)     /* XBAR1_OUT2 -> eDMA4  DMA_MUX_REQ156 */
#define IMXRT_XBAR1_OUT_EDMA4_DMA_MUX_REQ157            IMXRT_XBAR1(XBAR_OUTPUT, 3)     /* XBAR1_OUT3 -> eDMA4  DMA_MUX_REQ157 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT04              IMXRT_XBAR1(XBAR_OUTPUT, 4)     /* XBAR1_OUT4 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 00[MUX_MODE] = 0x1 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT05              IMXRT_XBAR1(XBAR_OUTPUT, 5)     /* XBAR1_OUT5 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 01[MUX_MODE] = 0x1 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT06              IMXRT_XBAR1(XBAR_OUTPUT, 6)     /* XBAR1_OUT6 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 02[MUX_MODE] = 0x1 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT07              IMXRT_XBAR1(XBAR_OUTPUT, 7)     /* XBAR1_OUT7 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 03[MUX_MODE] = 0x1 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT08              IMXRT_XBAR1(XBAR_OUTPUT, 8)     /* XBAR1_OUT8 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 04[MUX_MODE] = 0x1 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT09              IMXRT_XBAR1(XBAR_OUTPUT, 9)     /* XBAR1_OUT9 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 05[MUX_MODE] = 0x1 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT10              IMXRT_XBAR1(XBAR_OUTPUT, 10)    /* XBAR1_OUT10 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 26[MUX_MODE] = 0x2 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT11              IMXRT_XBAR1(XBAR_OUTPUT, 11)    /* XBAR1_OUT11 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 27[MUX_MODE] = 0x2 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT12              IMXRT_XBAR1(XBAR_OUTPUT, 12)    /* XBAR1_OUT12 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 28[MUX_MODE] = 0x2 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT13              IMXRT_XBAR1(XBAR_OUTPUT, 13)    /* XBAR1_OUT13 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 29[MUX_MODE] = 0x2 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT14              IMXRT_XBAR1(XBAR_OUTPUT, 14)    /* XBAR1_OUT14 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 30[MUX_MODE] = 0x2 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT15              IMXRT_XBAR1(XBAR_OUTPUT, 15)    /* XBAR1_OUT15 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B1_ 39[MUX_MODE] = 0x2 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT16              IMXRT_XBAR1(XBAR_OUTPUT, 16)    /* XBAR1_OUT16 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 18[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT17              IMXRT_XBAR1(XBAR_OUTPUT, 17)    /* XBAR1_OUT17 -> -  SW_MUX_CTL_PAD_GPIO_AD_33[MU See IOMUX Controller X_MODE] = */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT18              IMXRT_XBAR1(XBAR_OUTPUT, 18)    /* XBAR1_OUT18 -> -  SW_MUX_CTL_PAD_GPIO_AD_12[MU See IOMUX Controller X_MODE] = */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT19              IMXRT_XBAR1(XBAR_OUTPUT, 19)    /* XBAR1_OUT19 -> -  SW_MUX_CTL_PAD_GPIO_AD_19[MU See IOMUX Controller X_MODE] = */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT20              IMXRT_XBAR1(XBAR_OUTPUT, 20)    /* XBAR1_OUT20 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 00[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT21              IMXRT_XBAR1(XBAR_OUTPUT, 21)    /* XBAR1_OUT21 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 01[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT22              IMXRT_XBAR1(XBAR_OUTPUT, 22)    /* XBAR1_OUT22 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 02[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT23              IMXRT_XBAR1(XBAR_OUTPUT, 23)    /* XBAR1_OUT23 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 03[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT24              IMXRT_XBAR1(XBAR_OUTPUT, 24)    /* XBAR1_OUT24 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 04[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT25              IMXRT_XBAR1(XBAR_OUTPUT, 25)    /* XBAR1_OUT25 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 05[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT26              IMXRT_XBAR1(XBAR_OUTPUT, 26)    /* XBAR1_OUT26 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 06[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT27              IMXRT_XBAR1(XBAR_OUTPUT, 27)    /* XBAR1_OUT27 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 07[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT28              IMXRT_XBAR1(XBAR_OUTPUT, 28)    /* XBAR1_OUT28 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 08[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT29              IMXRT_XBAR1(XBAR_OUTPUT, 29)    /* XBAR1_OUT29 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 09[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT30              IMXRT_XBAR1(XBAR_OUTPUT, 30)    /* XBAR1_OUT30 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 10[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT31              IMXRT_XBAR1(XBAR_OUTPUT, 31)    /* XBAR1_OUT31 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 11[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT32              IMXRT_XBAR1(XBAR_OUTPUT, 32)    /* XBAR1_OUT32 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 12[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT33              IMXRT_XBAR1(XBAR_OUTPUT, 33)    /* XBAR1_OUT33 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 13[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT34              IMXRT_XBAR1(XBAR_OUTPUT, 34)    /* XBAR1_OUT34 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 14[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT35              IMXRT_XBAR1(XBAR_OUTPUT, 35)    /* XBAR1_OUT35 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 15[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT36              IMXRT_XBAR1(XBAR_OUTPUT, 36)    /* XBAR1_OUT36 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 19[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_IOMUX_XBAR_INOUT37              IMXRT_XBAR1(XBAR_OUTPUT, 37)    /* XBAR1_OUT37 -> -  SW_MUX_CTL_PAD_GPIO_EMC_B2_ 20[MUX_MODE] = 0x6 */
#define IMXRT_XBAR1_OUT_CMP1_SAMPLE                     IMXRT_XBAR1(XBAR_OUTPUT, 38)    /* XBAR1_OUT38 -> CMP1  SAMPLE */
#define IMXRT_XBAR1_OUT_CMP2_SAMPLE                     IMXRT_XBAR1(XBAR_OUTPUT, 39)    /* XBAR1_OUT39 -> CMP2  SAMPLE */
#define IMXRT_XBAR1_OUT_CMP3_SAMPLE                     IMXRT_XBAR1(XBAR_OUTPUT, 40)    /* XBAR1_OUT40 -> CMP3  SAMPLE */
#define IMXRT_XBAR1_OUT_CMP4_SAMPLE                     IMXRT_XBAR1(XBAR_OUTPUT, 41)    /* XBAR1_OUT41 -> CMP4  SAMPLE */
#define IMXRT_XBAR1_OUT_FLEXPWM1_EXTA0                  IMXRT_XBAR1(XBAR_OUTPUT, 42)    /* XBAR1_OUT42 -> FLEXPWM1  EXTA0 */
#define IMXRT_XBAR1_OUT_FLEXPWM1_EXTA1                  IMXRT_XBAR1(XBAR_OUTPUT, 43)    /* XBAR1_OUT43 -> FLEXPWM1  EXTA1 */
#define IMXRT_XBAR1_OUT_FLEXPWM1_EXTA2                  IMXRT_XBAR1(XBAR_OUTPUT, 44)    /* XBAR1_OUT44 -> FLEXPWM1  EXTA2 */
#define IMXRT_XBAR1_OUT_FLEXPWM1_EXTA3                  IMXRT_XBAR1(XBAR_OUTPUT, 45)    /* XBAR1_OUT45 -> FLEXPWM1  EXTA3 */
#define IMXRT_XBAR1_OUT_FLEXPWM1_EXT_SYNC0              IMXRT_XBAR1(XBAR_OUTPUT, 46)    /* XBAR1_OUT46 -> FLEXPWM1  EXT_SYNC0 */
#define IMXRT_XBAR1_OUT_FLEXPWM1_EXT_SYNC1              IMXRT_XBAR1(XBAR_OUTPUT, 47)    /* XBAR1_OUT47 -> FLEXPWM1  EXT_SYNC1 */
#define IMXRT_XBAR1_OUT_FLEXPWM1_EXT_SYNC2              IMXRT_XBAR1(XBAR_OUTPUT, 48)    /* XBAR1_OUT48 -> FLEXPWM1  EXT_SYNC2 */
#define IMXRT_XBAR1_OUT_FLEXPWM1_EXT_SYNC3              IMXRT_XBAR1(XBAR_OUTPUT, 49)    /* XBAR1_OUT49 -> FLEXPWM1  EXT_SYNC3 */
#define IMXRT_XBAR1_OUT_FLEXPWM1_EXT_CLK                IMXRT_XBAR1(XBAR_OUTPUT, 50)    /* XBAR1_OUT50 -> FLEXPWM1  EXT_CLK */
#define IMXRT_XBAR1_OUT_FLEXPWM1_FAULT0                 IMXRT_XBAR1(XBAR_OUTPUT, 51)    /* XBAR1_OUT51 -> FLEXPWM1  FAULT0 */
#define IMXRT_XBAR1_OUT_FLEXPWM1_FAULT1                 IMXRT_XBAR1(XBAR_OUTPUT, 52)    /* XBAR1_OUT52 -> FLEXPWM1  FAULT1 */
#define IMXRT_XBAR1_OUT_FLEXPWM1_FAULT2                 IMXRT_XBAR1(XBAR_OUTPUT, 53)    /* XBAR1_OUT53 -> FLEXPWM1  FAULT2 */
#define IMXRT_XBAR1_OUT_FLEXPWM1_FAULT3                 IMXRT_XBAR1(XBAR_OUTPUT, 54)    /* XBAR1_OUT54 -> FLEXPWM1  FAULT3 */
#define IMXRT_XBAR1_OUT_FLEXPWM1_EXT_FORCE              IMXRT_XBAR1(XBAR_OUTPUT, 55)    /* XBAR1_OUT55 -> FLEXPWM1  EXT_FORCE */
#define IMXRT_XBAR1_OUT_FLEXPWM2_EXTA0                  IMXRT_XBAR1(XBAR_OUTPUT, 56)    /* XBAR1_OUT56 -> FLEXPWM2  EXTA0 */
#define IMXRT_XBAR1_OUT_FLEXPWM2_EXTA1                  IMXRT_XBAR1(XBAR_OUTPUT, 57)    /* XBAR1_OUT57 -> FLEXPWM2  EXTA1 */
#define IMXRT_XBAR1_OUT_FLEXPWM2_EXTA2                  IMXRT_XBAR1(XBAR_OUTPUT, 58)    /* XBAR1_OUT58 -> FLEXPWM2  EXTA2 */
#define IMXRT_XBAR1_OUT_FLEXPWM2_EXTA3                  IMXRT_XBAR1(XBAR_OUTPUT, 59)    /* XBAR1_OUT59 -> FLEXPWM2  EXTA3 */
#define IMXRT_XBAR1_OUT_FLEXPWM2_EXT_SYNC0              IMXRT_XBAR1(XBAR_OUTPUT, 60)    /* XBAR1_OUT60 -> FLEXPWM2  EXT_SYNC0 */
#define IMXRT_XBAR1_OUT_FLEXPWM2_EXT_SYNC1              IMXRT_XBAR1(XBAR_OUTPUT, 61)    /* XBAR1_OUT61 -> FLEXPWM2  EXT_SYNC1 */
#define IMXRT_XBAR1_OUT_FLEXPWM2_EXT_SYNC2              IMXRT_XBAR1(XBAR_OUTPUT, 62)    /* XBAR1_OUT62 -> FLEXPWM2  EXT_SYNC2 */
#define IMXRT_XBAR1_OUT_FLEXPWM2_EXT_SYNC3              IMXRT_XBAR1(XBAR_OUTPUT, 63)    /* XBAR1_OUT63 -> FLEXPWM2  EXT_SYNC3 */
#define IMXRT_XBAR1_OUT_FLEXPWM2_EXT_CLK                IMXRT_XBAR1(XBAR_OUTPUT, 64)    /* XBAR1_OUT64 -> FLEXPWM2  EXT_CLK */
#define IMXRT_XBAR1_OUT_FLEXPWM2_FAULT0                 IMXRT_XBAR1(XBAR_OUTPUT, 65)    /* XBAR1_OUT65 -> FLEXPWM2  FAULT0 */
#define IMXRT_XBAR1_OUT_FLEXPWM2_FAULT1                 IMXRT_XBAR1(XBAR_OUTPUT, 66)    /* XBAR1_OUT66 -> FLEXPWM2  FAULT1 */
#define IMXRT_XBAR1_OUT_FLEXPWM2_EXT_FORCE              IMXRT_XBAR1(XBAR_OUTPUT, 67)    /* XBAR1_OUT67 -> FLEXPWM2  EXT_FORCE */
#define IMXRT_XBAR1_OUT_FLEXPWM3_EXTA0                  IMXRT_XBAR1(XBAR_OUTPUT, 68)    /* XBAR1_OUT68 -> FLEXPWM3  EXTA0 */
#define IMXRT_XBAR1_OUT_FLEXPWM3_EXTA1                  IMXRT_XBAR1(XBAR_OUTPUT, 69)    /* XBAR1_OUT69 -> FLEXPWM3  EXTA1 */
#define IMXRT_XBAR1_OUT_FLEXPWM3_EXTA2                  IMXRT_XBAR1(XBAR_OUTPUT, 70)    /* XBAR1_OUT70 -> FLEXPWM3  EXTA2 */
#define IMXRT_XBAR1_OUT_FLEXPWM3_EXTA3                  IMXRT_XBAR1(XBAR_OUTPUT, 71)    /* XBAR1_OUT71 -> FLEXPWM3  EXTA3 */
#define IMXRT_XBAR1_OUT_FLEXPWM3_EXT_CLK                IMXRT_XBAR1(XBAR_OUTPUT, 72)    /* XBAR1_OUT72 -> FLEXPWM3  EXT_CLK */
#define IMXRT_XBAR1_OUT_FLEXPWM3_EXT_SYNC0              IMXRT_XBAR1(XBAR_OUTPUT, 73)    /* XBAR1_OUT73 -> FLEXPWM3  EXT_SYNC0 */
#define IMXRT_XBAR1_OUT_FLEXPWM3_EXT_SYNC1              IMXRT_XBAR1(XBAR_OUTPUT, 74)    /* XBAR1_OUT74 -> FLEXPWM3  EXT_SYNC1 */
#define IMXRT_XBAR1_OUT_FLEXPWM3_EXT_SYNC2              IMXRT_XBAR1(XBAR_OUTPUT, 75)    /* XBAR1_OUT75 -> FLEXPWM3  EXT_SYNC2 */
#define IMXRT_XBAR1_OUT_FLEXPWM3_EXT_SYNC3              IMXRT_XBAR1(XBAR_OUTPUT, 76)    /* XBAR1_OUT76 -> FLEXPWM3  EXT_SYNC3 */
#define IMXRT_XBAR1_OUT_FLEXPWM3_FAULT0                 IMXRT_XBAR1(XBAR_OUTPUT, 77)    /* XBAR1_OUT77 -> FLEXPWM3  FAULT0 */
#define IMXRT_XBAR1_OUT_FLEXPWM3_FAULT1                 IMXRT_XBAR1(XBAR_OUTPUT, 78)    /* XBAR1_OUT78 -> FLEXPWM3  FAULT1 */
#define IMXRT_XBAR1_OUT_FLEXPWM3_EXT_FORCE              IMXRT_XBAR1(XBAR_OUTPUT, 79)    /* XBAR1_OUT79 -> FLEXPWM3  EXT_FORCE */
#define IMXRT_XBAR1_OUT_FLEXPWM4_EXT_SYNC0              IMXRT_XBAR1(XBAR_OUTPUT, 80)    /* XBAR1_OUT80 -> FLEXPWM4  EXT_SYNC0 */
#define IMXRT_XBAR1_OUT_FLEXPWM4_EXT_SYNC1              IMXRT_XBAR1(XBAR_OUTPUT, 81)    /* XBAR1_OUT81 -> FLEXPWM4  EXT_SYNC1 */
#define IMXRT_XBAR1_OUT_FLEXPWM4_EXT_SYNC2              IMXRT_XBAR1(XBAR_OUTPUT, 82)    /* XBAR1_OUT82 -> FLEXPWM4  EXT_SYNC2 */
#define IMXRT_XBAR1_OUT_FLEXPWM4_EXT_SYNC3              IMXRT_XBAR1(XBAR_OUTPUT, 83)    /* XBAR1_OUT83 -> FLEXPWM4  EXT_SYNC3 */
#define IMXRT_XBAR1_OUT_FLEXPWM4_FAULT0                 IMXRT_XBAR1(XBAR_OUTPUT, 84)    /* XBAR1_OUT84 -> FLEXPWM4  FAULT0 */
#define IMXRT_XBAR1_OUT_FLEXPWM4_FAULT1                 IMXRT_XBAR1(XBAR_OUTPUT, 85)    /* XBAR1_OUT85 -> FLEXPWM4  FAULT1 */
#define IMXRT_XBAR1_OUT_FLEXPWM4_EXT_FORCE              IMXRT_XBAR1(XBAR_OUTPUT, 86)    /* XBAR1_OUT86 -> FLEXPWM4  EXT_FORCE */
#define IMXRT_XBAR1_OUT_EQDC1_PHASE_A_INPUT             IMXRT_XBAR1(XBAR_OUTPUT, 87)    /* XBAR1_OUT87 -> eQDC1  PHASE_A_INPUT */
#define IMXRT_XBAR1_OUT_EQDC1_PHASE_B_INPUT             IMXRT_XBAR1(XBAR_OUTPUT, 88)    /* XBAR1_OUT88 -> eQDC1  PHASE_B_INPUT */
#define IMXRT_XBAR1_OUT_EQDC1_INDEX                     IMXRT_XBAR1(XBAR_OUTPUT, 89)    /* XBAR1_OUT89 -> eQDC1  INDEX */
#define IMXRT_XBAR1_OUT_EQDC1_HOME                      IMXRT_XBAR1(XBAR_OUTPUT, 90)    /* XBAR1_OUT90 -> eQDC1  HOME */
#define IMXRT_XBAR1_OUT_EQDC1_TRIGGER                   IMXRT_XBAR1(XBAR_OUTPUT, 91)    /* XBAR1_OUT91 -> eQDC1  TRIGGER */
#define IMXRT_XBAR1_OUT_EQDC2_PHASE_A_INPUT             IMXRT_XBAR1(XBAR_OUTPUT, 92)    /* XBAR1_OUT92 -> eQDC2  PHASE_A_INPUT */
#define IMXRT_XBAR1_OUT_EQDC2_PHASE_B_INPUT             IMXRT_XBAR1(XBAR_OUTPUT, 93)    /* XBAR1_OUT93 -> eQDC2  PHASE_B_INPUT */
#define IMXRT_XBAR1_OUT_EQDC2_INDEX                     IMXRT_XBAR1(XBAR_OUTPUT, 94)    /* XBAR1_OUT94 -> eQDC2  INDEX */
#define IMXRT_XBAR1_OUT_EQDC2_HOME                      IMXRT_XBAR1(XBAR_OUTPUT, 95)    /* XBAR1_OUT95 -> eQDC2  HOME */
#define IMXRT_XBAR1_OUT_EQDC2_TRIGGER                   IMXRT_XBAR1(XBAR_OUTPUT, 96)    /* XBAR1_OUT96 -> eQDC2  TRIGGER */
#define IMXRT_XBAR1_OUT_EQDC3_PHASE_A_INPUT             IMXRT_XBAR1(XBAR_OUTPUT, 97)    /* XBAR1_OUT97 -> eQDC3  PHASE_A_INPUT */
#define IMXRT_XBAR1_OUT_EQDC3_PHASE_B_INPUT             IMXRT_XBAR1(XBAR_OUTPUT, 98)    /* XBAR1_OUT98 -> eQDC3  PHASE_B_INPUT */
#define IMXRT_XBAR1_OUT_EQDC3_INDEX                     IMXRT_XBAR1(XBAR_OUTPUT, 99)    /* XBAR1_OUT99 -> eQDC3  INDEX */
#define IMXRT_XBAR1_OUT_EQDC3_HOME                      IMXRT_XBAR1(XBAR_OUTPUT, 100)   /* XBAR1_OUT100 -> eQDC3  HOME */
#define IMXRT_XBAR1_OUT_EQDC3_TRIGGER                   IMXRT_XBAR1(XBAR_OUTPUT, 101)   /* XBAR1_OUT101 -> eQDC3  TRIGGER */
#define IMXRT_XBAR1_OUT_EQDC4_PHASE_A_INPUT             IMXRT_XBAR1(XBAR_OUTPUT, 102)   /* XBAR1_OUT102 -> eQDC4  PHASE_A_INPUT */
#define IMXRT_XBAR1_OUT_EQDC4_PHASE_B_INPUT             IMXRT_XBAR1(XBAR_OUTPUT, 103)   /* XBAR1_OUT103 -> eQDC4  PHASE_B_INPUT */
#define IMXRT_XBAR1_OUT_EQDC4_INDEX                     IMXRT_XBAR1(XBAR_OUTPUT, 104)   /* XBAR1_OUT104 -> eQDC4  INDEX */
#define IMXRT_XBAR1_OUT_EQDC4_HOME                      IMXRT_XBAR1(XBAR_OUTPUT, 105)   /* XBAR1_OUT105 -> eQDC4  HOME */
#define IMXRT_XBAR1_OUT_EQDC4_TRIGGER                   IMXRT_XBAR1(XBAR_OUTPUT, 106)   /* XBAR1_OUT106 -> eQDC4  TRIGGER */
#define IMXRT_XBAR1_OUT_TMR1_TMR0_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 107)   /* XBAR1_OUT107 -> TMR1  TMR0_INPUT QTIMER_CTRL1[QTIMER1_TM R0_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR1_TMR1_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 108)   /* XBAR1_OUT108 -> TMR1  TMR1_INPUT QTIMER_CTRL1[QTIMER1_TM R1_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR1_TMR2_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 109)   /* XBAR1_OUT109 -> TMR1  TMR2_INPUT QTIMER_CTRL1[QTIMER1_TM R2_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR1_TMR3_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 110)   /* XBAR1_OUT110 -> TMR1  TMR3_INPUT QTIMER_CTRL1[QTIMER1_TM R3_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR2_TMR0_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 111)   /* XBAR1_OUT111 -> TMR2  TMR0_INPUT QTIMER_CTRL1[QTIMER2_TM R0_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR2_TMR1_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 112)   /* XBAR1_OUT112 -> TMR2  TMR1_INPUT QTIMER_CTRL1[QTIMER2_TM R1_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR2_TMR2_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 113)   /* XBAR1_OUT113 -> TMR2  TMR2_INPUT QTIMER_CTRL1[QTIMER2_TM R2_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR2_TMR3_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 114)   /* XBAR1_OUT114 -> TMR2  TMR3_INPUT QTIMER_CTRL1[QTIMER2_TM R3_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR3_TMR0_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 115)   /* XBAR1_OUT115 -> TMR3  TMR0_INPUT QTIMER_CTRL1[QTIMER3_TM R0_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR3_TMR1_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 116)   /* XBAR1_OUT116 -> TMR3  TMR1_INPUT QTIMER_CTRL1[QTIMER3_TM R1_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR3_TMR2_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 117)   /* XBAR1_OUT117 -> TMR3  TMR2_INPUT QTIMER_CTRL1[QTIMER3_TM R2_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR3_TMR3_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 118)   /* XBAR1_OUT118 -> TMR3  TMR3_INPUT QTIMER_CTRL1[QTIMER3_TM R3_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR4_TMR0_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 119)   /* XBAR1_OUT119 -> TMR4  TMR0_INPUT QTIMER_CTRL1[QTIMER4_TM R0_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR4_TMR1_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 120)   /* XBAR1_OUT120 -> TMR4  TMR1_INPUT QTIMER_CTRL1[QTIMER4_TM R1_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR4_TMR2_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 121)   /* XBAR1_OUT121 -> TMR4  TMR2_INPUT QTIMER_CTRL1[QTIMER4_TM R2_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR4_TMR3_INPUT_QTIMER_CTRL1    IMXRT_XBAR1(XBAR_OUTPUT, 122)   /* XBAR1_OUT122 -> TMR4  TMR3_INPUT QTIMER_CTRL1[QTIMER4_TM R3_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR5_TMR0_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 123)   /* XBAR1_OUT123 -> TMR5  TMR0_INPUT QTIMER_CTRL2[QTIMER5_TM R0_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR5_TMR1_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 124)   /* XBAR1_OUT124 -> TMR5  TMR1_INPUT QTIMER_CTRL2[QTIMER5_TM R1_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR5_TMR2_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 125)   /* XBAR1_OUT125 -> TMR5  TMR2_INPUT QTIMER_CTRL2[QTIMER5_TM R2_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR5_TMR3_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 126)   /* XBAR1_OUT126 -> TMR5  TMR3_INPUT QTIMER_CTRL2[QTIMER5_TM R3_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR6_TMR0_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 127)   /* XBAR1_OUT127 -> TMR6  TMR0_INPUT QTIMER_CTRL2[QTIMER6_TM R0_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR6_TMR1_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 128)   /* XBAR1_OUT128 -> TMR6  TMR1_INPUT QTIMER_CTRL2[QTIMER6_TM R1_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR6_TMR2_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 129)   /* XBAR1_OUT129 -> TMR6  TMR2_INPUT QTIMER_CTRL2[QTIMER6_TM R2_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR6_TMR3_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 130)   /* XBAR1_OUT130 -> TMR6  TMR3_INPUT QTIMER_CTRL2[QTIMER6_TM R3_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR7_TMR0_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 131)   /* XBAR1_OUT131 -> TMR7  TMR0_INPUT QTIMER_CTRL2[QTIMER7_TM R0_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR7_TMR1_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 132)   /* XBAR1_OUT132 -> TMR7  TMR1_INPUT QTIMER_CTRL2[QTIMER7_TM R1_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR7_TMR2_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 133)   /* XBAR1_OUT133 -> TMR7  TMR2_INPUT QTIMER_CTRL2[QTIMER7_TM R2_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR7_TMR3_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 134)   /* XBAR1_OUT134 -> TMR7  TMR3_INPUT QTIMER_CTRL2[QTIMER7_TM R3_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR8_TMR0_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 135)   /* XBAR1_OUT135 -> TMR8  TMR0_INPUT QTIMER_CTRL2[QTIMER8_TM R0_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR8_TMR1_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 136)   /* XBAR1_OUT136 -> TMR8  TMR1_INPUT QTIMER_CTRL2[QTIMER8_TM R1_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR8_TMR2_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 137)   /* XBAR1_OUT137 -> TMR8  TMR2_INPUT QTIMER_CTRL2[QTIMER8_TM R2_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_TMR8_TMR3_INPUT_QTIMER_CTRL2    IMXRT_XBAR1(XBAR_OUTPUT, 138)   /* XBAR1_OUT138 -> TMR8  TMR3_INPUT QTIMER_CTRL2[QTIMER8_TM R3_INPUT_SEL] = 1 */
#define IMXRT_XBAR1_OUT_EWM_EWM_IN                      IMXRT_XBAR1(XBAR_OUTPUT, 139)   /* XBAR1_OUT139 -> EWM  EWM_IN */
#define IMXRT_XBAR1_OUT_ADC1_HW_TRG0                    IMXRT_XBAR1(XBAR_OUTPUT, 140)   /* XBAR1_OUT140 -> ADC1  HW_TRG0 */
#define IMXRT_XBAR1_OUT_ADC1_HW_TRG1                    IMXRT_XBAR1(XBAR_OUTPUT, 141)   /* XBAR1_OUT141 -> ADC1  HW_TRG1 */
#define IMXRT_XBAR1_OUT_ADC1_HW_TRG2                    IMXRT_XBAR1(XBAR_OUTPUT, 142)   /* XBAR1_OUT142 -> ADC1  HW_TRG2 */
#define IMXRT_XBAR1_OUT_ADC1_HW_TRG3                    IMXRT_XBAR1(XBAR_OUTPUT, 143)   /* XBAR1_OUT143 -> ADC1  HW_TRG3 */
#define IMXRT_XBAR1_OUT_ADC1_HW_TRG4                    IMXRT_XBAR1(XBAR_OUTPUT, 144)   /* XBAR1_OUT144 -> ADC1  HW_TRG4 */
#define IMXRT_XBAR1_OUT_ADC1_HW_TRG5                    IMXRT_XBAR1(XBAR_OUTPUT, 145)   /* XBAR1_OUT145 -> ADC1  HW_TRG5 */
#define IMXRT_XBAR1_OUT_ADC1_HW_TRG6                    IMXRT_XBAR1(XBAR_OUTPUT, 146)   /* XBAR1_OUT146 -> ADC1  HW_TRG6 */
#define IMXRT_XBAR1_OUT_ADC1_HW_TRG7                    IMXRT_XBAR1(XBAR_OUTPUT, 147)   /* XBAR1_OUT147 -> ADC1  HW_TRG7 */
#define IMXRT_XBAR1_OUT_SINC1_EXT_TRIGGER0              IMXRT_XBAR1(XBAR_OUTPUT, 148)   /* XBAR1_OUT148 -> SINC1  EXT_TRIGGER0 */
#define IMXRT_XBAR1_OUT_SINC1_EXT_TRIGGER1              IMXRT_XBAR1(XBAR_OUTPUT, 149)   /* XBAR1_OUT149 -> SINC1  EXT_TRIGGER1 */
#define IMXRT_XBAR1_OUT_SINC1_EXT_TRIGGER2              IMXRT_XBAR1(XBAR_OUTPUT, 150)   /* XBAR1_OUT150 -> SINC1  EXT_TRIGGER2 */
#define IMXRT_XBAR1_OUT_SINC1_EXT_TRIGGER3              IMXRT_XBAR1(XBAR_OUTPUT, 151)   /* XBAR1_OUT151 -> SINC1  EXT_TRIGGER3 */
#define IMXRT_XBAR1_OUT_FLEXIO1_FLEXIO_TRIGGER_IN0      IMXRT_XBAR1(XBAR_OUTPUT, 152)   /* XBAR1_OUT152 -> FLEXIO1  FLEXIO_TRIGGER_IN0 */
#define IMXRT_XBAR1_OUT_FLEXIO1_FLEXIO_TRIGGER_IN1      IMXRT_XBAR1(XBAR_OUTPUT, 153)   /* XBAR1_OUT153 -> FLEXIO1  FLEXIO_TRIGGER_IN1 */
#define IMXRT_XBAR1_OUT_FLEXIO2_FLEXIO_TRIGGER_IN0      IMXRT_XBAR1(XBAR_OUTPUT, 154)   /* XBAR1_OUT154 -> FLEXIO2  FLEXIO_TRIGGER_IN0 */
#define IMXRT_XBAR1_OUT_FLEXIO2_FLEXIO_TRIGGER_IN1      IMXRT_XBAR1(XBAR_OUTPUT, 155)   /* XBAR1_OUT155 -> FLEXIO2  FLEXIO_TRIGGER_IN1 */
#define IMXRT_XBAR1_OUT_LPI2C1_LPI2C_TRG_INPUT          IMXRT_XBAR1(XBAR_OUTPUT, 156)   /* XBAR1_OUT156 -> LPI2C1  LPI2C_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPI2C2_LPI2C_TRG_INPUT          IMXRT_XBAR1(XBAR_OUTPUT, 157)   /* XBAR1_OUT157 -> LPI2C2  LPI2C_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPI2C3_LPI2C_TRG_INPUT          IMXRT_XBAR1(XBAR_OUTPUT, 158)   /* XBAR1_OUT158 -> LPI2C3  LPI2C_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPI2C4_LPI2C_TRG_INPUT          IMXRT_XBAR1(XBAR_OUTPUT, 159)   /* XBAR1_OUT159 -> LPI2C4  LPI2C_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPI2C5_LPI2C_TRG_INPUT          IMXRT_XBAR1(XBAR_OUTPUT, 160)   /* XBAR1_OUT160 -> LPI2C5  LPI2C_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPI2C6_LPI2C_TRG_INPUT          IMXRT_XBAR1(XBAR_OUTPUT, 161)   /* XBAR1_OUT161 -> LPI2C6  LPI2C_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPSPI1_LPSPI_TRG_INPUT          IMXRT_XBAR1(XBAR_OUTPUT, 162)   /* XBAR1_OUT162 -> LPSPI1  LPSPI_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPSPI2_LPSPI_TRG_INPUT          IMXRT_XBAR1(XBAR_OUTPUT, 163)   /* XBAR1_OUT163 -> LPSPI2  LPSPI_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPSPI3_LPSPI_TRG_INPUT          IMXRT_XBAR1(XBAR_OUTPUT, 164)   /* XBAR1_OUT164 -> LPSPI3  LPSPI_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPSPI4_LPSPI_TRG_INPUT          IMXRT_XBAR1(XBAR_OUTPUT, 165)   /* XBAR1_OUT165 -> LPSPI4  LPSPI_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPSPI5_LPSPI_TRG_INPUT          IMXRT_XBAR1(XBAR_OUTPUT, 166)   /* XBAR1_OUT166 -> LPSPI5  LPSPI_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPSPI6_LPSPI_TRG_INPUT          IMXRT_XBAR1(XBAR_OUTPUT, 167)   /* XBAR1_OUT167 -> LPSPI6  LPSPI_TRG_INPUT */
