apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_xbar.h
#define IMXRT_XBAR1_OUT_LPUART1_LPUART_TRG_INPUT        IMXRT_XBAR1(XBAR_OUTPUT, 168)   /* XBAR1_OUT168 -> LPUART1  LPUART_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPUART2_LPUART_TRG_INPUT        IMXRT_XBAR1(XBAR_OUTPUT, 169)   /* XBAR1_OUT169 -> LPUART2  LPUART_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPUART3_LPUART_TRG_INPUT        IMXRT_XBAR1(XBAR_OUTPUT, 170)   /* XBAR1_OUT170 -> LPUART3  LPUART_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPUART4_LPUART_TRG_INPUT        IMXRT_XBAR1(XBAR_OUTPUT, 171)   /* XBAR1_OUT171 -> LPUART4  LPUART_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPUART5_LPUART_TRG_INPUT        IMXRT_XBAR1(XBAR_OUTPUT, 172)   /* XBAR1_OUT172 -> LPUART5  LPUART_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPUART6_LPUART_TRG_INPUT        IMXRT_XBAR1(XBAR_OUTPUT, 173)   /* XBAR1_OUT173 -> LPUART6  LPUART_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPUART7_LPUART_TRG_INPUT        IMXRT_XBAR1(XBAR_OUTPUT, 174)   /* XBAR1_OUT174 -> LPUART7  LPUART_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPUART8_LPUART_TRG_INPUT        IMXRT_XBAR1(XBAR_OUTPUT, 175)   /* XBAR1_OUT175 -> LPUART8  LPUART_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPUART9_LPUART_TRG_INPUT        IMXRT_XBAR1(XBAR_OUTPUT, 176)   /* XBAR1_OUT176 -> LPUART9  LPUART_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPUART10_LPUART_TRG_INPUT       IMXRT_XBAR1(XBAR_OUTPUT, 177)   /* XBAR1_OUT177 -> LPUART10  LPUART_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPUART11_LPUART_TRG_INPUT       IMXRT_XBAR1(XBAR_OUTPUT, 178)   /* XBAR1_OUT178 -> LPUART11  LPUART_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPUART12_LPUART_TRG_INPUT       IMXRT_XBAR1(XBAR_OUTPUT, 179)   /* XBAR1_OUT179 -> LPUART12  LPUART_TRG_INPUT */
#define IMXRT_XBAR1_OUT_LPIT1_LPIT_EXT_TRIG_IN0         IMXRT_XBAR1(XBAR_OUTPUT, 180)   /* XBAR1_OUT180 -> LPIT1  LPIT_EXT_TRIG_IN0 */
#define IMXRT_XBAR1_OUT_LPIT1_LPIT_EXT_TRIG_IN1         IMXRT_XBAR1(XBAR_OUTPUT, 181)   /* XBAR1_OUT181 -> LPIT1  LPIT_EXT_TRIG_IN1 */
#define IMXRT_XBAR1_OUT_LPIT1_LPIT_EXT_TRIG_IN2         IMXRT_XBAR1(XBAR_OUTPUT, 182)   /* XBAR1_OUT182 -> LPIT1  LPIT_EXT_TRIG_IN2 */
#define IMXRT_XBAR1_OUT_LPIT1_LPIT_EXT_TRIG_IN3         IMXRT_XBAR1(XBAR_OUTPUT, 183)   /* XBAR1_OUT183 -> LPIT1  LPIT_EXT_TRIG_IN3 */
#define IMXRT_XBAR1_OUT_TPM1_TPM_TRIGGER_IN0            IMXRT_XBAR1(XBAR_OUTPUT, 184)   /* XBAR1_OUT184 -> TPM1  TPM_TRIGGER_IN0 */
#define IMXRT_XBAR1_OUT_TPM1_TPM_TRIGGER_IN1            IMXRT_XBAR1(XBAR_OUTPUT, 185)   /* XBAR1_OUT185 -> TPM1  TPM_TRIGGER_IN1 */
#define IMXRT_XBAR1_OUT_TPM2_TPM_TRIGGER_IN1            IMXRT_XBAR1(XBAR_OUTPUT, 186)   /* XBAR1_OUT186 -> TPM2  TPM_TRIGGER_IN1 */
#define IMXRT_XBAR1_OUT_TPM3_TPM_TRIGGER_IN1            IMXRT_XBAR1(XBAR_OUTPUT, 187)   /* XBAR1_OUT187 -> TPM3  TPM_TRIGGER_IN1 */
#define IMXRT_XBAR1_OUT_TPM1_TPM_TRIGGER_IN2            IMXRT_XBAR1(XBAR_OUTPUT, 188)   /* XBAR1_OUT188 -> TPM1  TPM_TRIGGER_IN2 */
#define IMXRT_XBAR1_OUT_TPM1_TPM_TRIGGER_IN3            IMXRT_XBAR1(XBAR_OUTPUT, 189)   /* XBAR1_OUT189 -> TPM1  TPM_TRIGGER_IN3 */
#define IMXRT_XBAR1_OUT_TPM2_TPM_TRIGGER_IN3            IMXRT_XBAR1(XBAR_OUTPUT, 190)   /* XBAR1_OUT190 -> TPM2  TPM_TRIGGER_IN3 */
#define IMXRT_XBAR1_OUT_TPM3_TPM_TRIGGER_IN3            IMXRT_XBAR1(XBAR_OUTPUT, 191)   /* XBAR1_OUT191 -> TPM3  TPM_TRIGGER_IN3 */
#define IMXRT_XBAR1_OUT_TPM4_TPM_TRIGGER_IN0            IMXRT_XBAR1(XBAR_OUTPUT, 192)   /* XBAR1_OUT192 -> TPM4  TPM_TRIGGER_IN0 */
#define IMXRT_XBAR1_OUT_TPM4_TPM_TRIGGER_IN1            IMXRT_XBAR1(XBAR_OUTPUT, 193)   /* XBAR1_OUT193 -> TPM4  TPM_TRIGGER_IN1 */
#define IMXRT_XBAR1_OUT_TPM5_TPM_TRIGGER_IN1            IMXRT_XBAR1(XBAR_OUTPUT, 194)   /* XBAR1_OUT194 -> TPM5  TPM_TRIGGER_IN1 */
#define IMXRT_XBAR1_OUT_TPM6_TPM_TRIGGER_IN1            IMXRT_XBAR1(XBAR_OUTPUT, 195)   /* XBAR1_OUT195 -> TPM6  TPM_TRIGGER_IN1 */
#define IMXRT_XBAR1_OUT_TPM4_TPM_TRIGGER_IN2            IMXRT_XBAR1(XBAR_OUTPUT, 196)   /* XBAR1_OUT196 -> TPM4  TPM_TRIGGER_IN2 */
#define IMXRT_XBAR1_OUT_TPM4_TPM_TRIGGER_IN3            IMXRT_XBAR1(XBAR_OUTPUT, 197)   /* XBAR1_OUT197 -> TPM4  TPM_TRIGGER_IN3 */
#define IMXRT_XBAR1_OUT_TPM5_TPM_TRIGGER_IN3            IMXRT_XBAR1(XBAR_OUTPUT, 198)   /* XBAR1_OUT198 -> TPM5  TPM_TRIGGER_IN3 */
#define IMXRT_XBAR1_OUT_TPM6_TPM_TRIGGER_IN3            IMXRT_XBAR1(XBAR_OUTPUT, 199)   /* XBAR1_OUT199 -> TPM6  TPM_TRIGGER_IN3 */
#define IMXRT_XBAR1_OUT_NETC_TMR_1588_TRIG1             IMXRT_XBAR1(XBAR_OUTPUT, 200)   /* XBAR1_OUT200 -> NETC  TMR_1588_TRIG1 */
#define IMXRT_XBAR1_OUT_NETC_TMR_1588_TRIG2             IMXRT_XBAR1(XBAR_OUTPUT, 201)   /* XBAR1_OUT201 -> NETC  TMR_1588_TRIG2 */
#define IMXRT_XBAR1_OUT_RESERVED                        IMXRT_XBAR1(XBAR_OUTPUT, 202)   /* XBAR1_OUT202 -> -  Reserved */
#define IMXRT_XBAR1_OUT_RESERVED_2                      IMXRT_XBAR1(XBAR_OUTPUT, 203)   /* XBAR1_OUT203 -> -  Reserved */
#define IMXRT_XBAR1_OUT_RESERVED_3                      IMXRT_XBAR1(XBAR_OUTPUT, 204)   /* XBAR1_OUT204 -> -  Reserved */
#define IMXRT_XBAR1_OUT_RESERVED_4                      IMXRT_XBAR1(XBAR_OUTPUT, 205)   /* XBAR1_OUT205 -> -  Reserved */
#define IMXRT_XBAR1_OUT_EQDC1_ICAP1                     IMXRT_XBAR1(XBAR_OUTPUT, 206)   /* XBAR1_OUT206 -> eQDC1  ICAP1 */
#define IMXRT_XBAR1_OUT_EQDC1_ICAP2                     IMXRT_XBAR1(XBAR_OUTPUT, 207)   /* XBAR1_OUT207 -> eQDC1  ICAP2 */
#define IMXRT_XBAR1_OUT_EQDC1_ICAP3                     IMXRT_XBAR1(XBAR_OUTPUT, 208)   /* XBAR1_OUT208 -> eQDC1  ICAP3 */
#define IMXRT_XBAR1_OUT_EQDC2_ICAP1                     IMXRT_XBAR1(XBAR_OUTPUT, 209)   /* XBAR1_OUT209 -> eQDC2  ICAP1 */
#define IMXRT_XBAR1_OUT_EQDC2_ICAP2                     IMXRT_XBAR1(XBAR_OUTPUT, 210)   /* XBAR1_OUT210 -> eQDC2  ICAP2 */
#define IMXRT_XBAR1_OUT_EQDC2_ICAP3                     IMXRT_XBAR1(XBAR_OUTPUT, 211)   /* XBAR1_OUT211 -> eQDC2  ICAP3 */
#define IMXRT_XBAR1_OUT_EQDC3_ICAP1                     IMXRT_XBAR1(XBAR_OUTPUT, 212)   /* XBAR1_OUT212 -> eQDC3  ICAP1 */
#define IMXRT_XBAR1_OUT_EQDC3_ICAP2                     IMXRT_XBAR1(XBAR_OUTPUT, 213)   /* XBAR1_OUT213 -> eQDC3  ICAP2 */
#define IMXRT_XBAR1_OUT_EQDC3_ICAP3                     IMXRT_XBAR1(XBAR_OUTPUT, 214)   /* XBAR1_OUT214 -> eQDC3  ICAP3 */
#define IMXRT_XBAR1_OUT_EQDC4_ICAP1                     IMXRT_XBAR1(XBAR_OUTPUT, 215)   /* XBAR1_OUT215 -> eQDC4  ICAP1 */
#define IMXRT_XBAR1_OUT_EQDC4_ICAP2                     IMXRT_XBAR1(XBAR_OUTPUT, 216)   /* XBAR1_OUT216 -> eQDC4  ICAP2 */
#define IMXRT_XBAR1_OUT_EQDC4_ICAP3                     IMXRT_XBAR1(XBAR_OUTPUT, 217)   /* XBAR1_OUT217 -> eQDC4  ICAP3 */
#define IMXRT_XBAR1_OUT_ECAT_LATCH_IN0                  IMXRT_XBAR1(XBAR_OUTPUT, 218)   /* XBAR1_OUT218 -> ECAT  LATCH_IN0 */
#define IMXRT_XBAR1_OUT_ECAT_LATCH_IN1                  IMXRT_XBAR1(XBAR_OUTPUT, 219)   /* XBAR1_OUT219 -> ECAT  LATCH_IN1 */
#define IMXRT_XBAR1_OUT_SAFETY_CLK_DUT_CLK_MON          IMXRT_XBAR1(XBAR_OUTPUT, 220)   /* XBAR1_OUT220 -> SAFETY_CLK DUT_CLK  - _MON */

