apache/nuttx/arch/arm/src/imxrt/hardware/rt118x/imxrt118x_xbar.h
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN0                    IMXRT_XBAR2(XBAR_OUTPUT, 0)     /* XBAR2_OUT0 -> AOI1  AOI_IN0 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN1                    IMXRT_XBAR2(XBAR_OUTPUT, 1)     /* XBAR2_OUT1 -> AOI1  AOI_IN1 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN2                    IMXRT_XBAR2(XBAR_OUTPUT, 2)     /* XBAR2_OUT2 -> AOI1  AOI_IN2 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN3                    IMXRT_XBAR2(XBAR_OUTPUT, 3)     /* XBAR2_OUT3 -> AOI1  AOI_IN3 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN4                    IMXRT_XBAR2(XBAR_OUTPUT, 4)     /* XBAR2_OUT4 -> AOI1  AOI_IN4 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN5                    IMXRT_XBAR2(XBAR_OUTPUT, 5)     /* XBAR2_OUT5 -> AOI1  AOI_IN5 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN6                    IMXRT_XBAR2(XBAR_OUTPUT, 6)     /* XBAR2_OUT6 -> AOI1  AOI_IN6 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN7                    IMXRT_XBAR2(XBAR_OUTPUT, 7)     /* XBAR2_OUT7 -> AOI1  AOI_IN7 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN8                    IMXRT_XBAR2(XBAR_OUTPUT, 8)     /* XBAR2_OUT8 -> AOI1  AOI_IN8 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN9                    IMXRT_XBAR2(XBAR_OUTPUT, 9)     /* XBAR2_OUT9 -> AOI1  AOI_IN9 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN10                   IMXRT_XBAR2(XBAR_OUTPUT, 10)    /* XBAR2_OUT10 -> AOI1  AOI_IN10 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN11                   IMXRT_XBAR2(XBAR_OUTPUT, 11)    /* XBAR2_OUT11 -> AOI1  AOI_IN11 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN12                   IMXRT_XBAR2(XBAR_OUTPUT, 12)    /* XBAR2_OUT12 -> AOI1  AOI_IN12 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN13                   IMXRT_XBAR2(XBAR_OUTPUT, 13)    /* XBAR2_OUT13 -> AOI1  AOI_IN13 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN14                   IMXRT_XBAR2(XBAR_OUTPUT, 14)    /* XBAR2_OUT14 -> AOI1  AOI_IN14 */
#define IMXRT_XBAR2_OUT_AOI1_AOI_IN15                   IMXRT_XBAR2(XBAR_OUTPUT, 15)    /* XBAR2_OUT15 -> AOI1  AOI_IN15 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN0                    IMXRT_XBAR2(XBAR_OUTPUT, 16)    /* XBAR2_OUT16 -> AOI3  AOI_IN0 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN1                    IMXRT_XBAR2(XBAR_OUTPUT, 17)    /* XBAR2_OUT17 -> AOI3  AOI_IN1 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN2                    IMXRT_XBAR2(XBAR_OUTPUT, 18)    /* XBAR2_OUT18 -> AOI3  AOI_IN2 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN3                    IMXRT_XBAR2(XBAR_OUTPUT, 19)    /* XBAR2_OUT19 -> AOI3  AOI_IN3 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN4                    IMXRT_XBAR2(XBAR_OUTPUT, 20)    /* XBAR2_OUT20 -> AOI3  AOI_IN4 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN5                    IMXRT_XBAR2(XBAR_OUTPUT, 21)    /* XBAR2_OUT21 -> AOI3  AOI_IN5 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN6                    IMXRT_XBAR2(XBAR_OUTPUT, 22)    /* XBAR2_OUT22 -> AOI3  AOI_IN6 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN7                    IMXRT_XBAR2(XBAR_OUTPUT, 23)    /* XBAR2_OUT23 -> AOI3  AOI_IN7 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN8                    IMXRT_XBAR2(XBAR_OUTPUT, 24)    /* XBAR2_OUT24 -> AOI3  AOI_IN8 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN9                    IMXRT_XBAR2(XBAR_OUTPUT, 25)    /* XBAR2_OUT25 -> AOI3  AOI_IN9 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN10                   IMXRT_XBAR2(XBAR_OUTPUT, 26)    /* XBAR2_OUT26 -> AOI3  AOI_IN10 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN11                   IMXRT_XBAR2(XBAR_OUTPUT, 27)    /* XBAR2_OUT27 -> AOI3  AOI_IN11 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN12                   IMXRT_XBAR2(XBAR_OUTPUT, 28)    /* XBAR2_OUT28 -> AOI3  AOI_IN12 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN13                   IMXRT_XBAR2(XBAR_OUTPUT, 29)    /* XBAR2_OUT29 -> AOI3  AOI_IN13 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN14                   IMXRT_XBAR2(XBAR_OUTPUT, 30)    /* XBAR2_OUT30 -> AOI3  AOI_IN14 */
#define IMXRT_XBAR2_OUT_AOI3_AOI_IN15                   IMXRT_XBAR2(XBAR_OUTPUT, 31)    /* XBAR2_OUT31 -> AOI3  AOI_IN15 */

#define IMXRT_XBAR3_OUT_AOI2_AOI_IN0                    IMXRT_XBAR3(XBAR_OUTPUT, 0)     /* XBAR3_OUT0 -> AOI2  AOI_IN0 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN1                    IMXRT_XBAR3(XBAR_OUTPUT, 1)     /* XBAR3_OUT1 -> AOI2  AOI_IN1 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN2                    IMXRT_XBAR3(XBAR_OUTPUT, 2)     /* XBAR3_OUT2 -> AOI2  AOI_IN2 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN3                    IMXRT_XBAR3(XBAR_OUTPUT, 3)     /* XBAR3_OUT3 -> AOI2  AOI_IN3 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN4                    IMXRT_XBAR3(XBAR_OUTPUT, 4)     /* XBAR3_OUT4 -> AOI2  AOI_IN4 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN5                    IMXRT_XBAR3(XBAR_OUTPUT, 5)     /* XBAR3_OUT5 -> AOI2  AOI_IN5 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN6                    IMXRT_XBAR3(XBAR_OUTPUT, 6)     /* XBAR3_OUT6 -> AOI2  AOI_IN6 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN7                    IMXRT_XBAR3(XBAR_OUTPUT, 7)     /* XBAR3_OUT7 -> AOI2  AOI_IN7 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN8                    IMXRT_XBAR3(XBAR_OUTPUT, 8)     /* XBAR3_OUT8 -> AOI2  AOI_IN8 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN9                    IMXRT_XBAR3(XBAR_OUTPUT, 9)     /* XBAR3_OUT9 -> AOI2  AOI_IN9 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN10                   IMXRT_XBAR3(XBAR_OUTPUT, 10)    /* XBAR3_OUT10 -> AOI2  AOI_IN10 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN11                   IMXRT_XBAR3(XBAR_OUTPUT, 11)    /* XBAR3_OUT11 -> AOI2  AOI_IN11 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN12                   IMXRT_XBAR3(XBAR_OUTPUT, 12)    /* XBAR3_OUT12 -> AOI2  AOI_IN12 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN13                   IMXRT_XBAR3(XBAR_OUTPUT, 13)    /* XBAR3_OUT13 -> AOI2  AOI_IN13 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN14                   IMXRT_XBAR3(XBAR_OUTPUT, 14)    /* XBAR3_OUT14 -> AOI2  AOI_IN14 */
#define IMXRT_XBAR3_OUT_AOI2_AOI_IN15                   IMXRT_XBAR3(XBAR_OUTPUT, 15)    /* XBAR3_OUT15 -> AOI2  AOI_IN15 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN0                    IMXRT_XBAR3(XBAR_OUTPUT, 16)    /* XBAR3_OUT16 -> AOI4  AOI_IN0 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN1                    IMXRT_XBAR3(XBAR_OUTPUT, 17)    /* XBAR3_OUT17 -> AOI4  AOI_IN1 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN2                    IMXRT_XBAR3(XBAR_OUTPUT, 18)    /* XBAR3_OUT18 -> AOI4  AOI_IN2 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN3                    IMXRT_XBAR3(XBAR_OUTPUT, 19)    /* XBAR3_OUT19 -> AOI4  AOI_IN3 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN4                    IMXRT_XBAR3(XBAR_OUTPUT, 20)    /* XBAR3_OUT20 -> AOI4  AOI_IN4 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN5                    IMXRT_XBAR3(XBAR_OUTPUT, 21)    /* XBAR3_OUT21 -> AOI4  AOI_IN5 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN6                    IMXRT_XBAR3(XBAR_OUTPUT, 22)    /* XBAR3_OUT22 -> AOI4  AOI_IN6 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN7                    IMXRT_XBAR3(XBAR_OUTPUT, 23)    /* XBAR3_OUT23 -> AOI4  AOI_IN7 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN8                    IMXRT_XBAR3(XBAR_OUTPUT, 24)    /* XBAR3_OUT24 -> AOI4  AOI_IN8 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN9                    IMXRT_XBAR3(XBAR_OUTPUT, 25)    /* XBAR3_OUT25 -> AOI4  AOI_IN9 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN10                   IMXRT_XBAR3(XBAR_OUTPUT, 26)    /* XBAR3_OUT26 -> AOI4  AOI_IN10 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN11                   IMXRT_XBAR3(XBAR_OUTPUT, 27)    /* XBAR3_OUT27 -> AOI4  AOI_IN11 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN12                   IMXRT_XBAR3(XBAR_OUTPUT, 28)    /* XBAR3_OUT28 -> AOI4  AOI_IN12 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN13                   IMXRT_XBAR3(XBAR_OUTPUT, 29)    /* XBAR3_OUT29 -> AOI4  AOI_IN13 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN14                   IMXRT_XBAR3(XBAR_OUTPUT, 30)    /* XBAR3_OUT30 -> AOI4  AOI_IN14 */
#define IMXRT_XBAR3_OUT_AOI4_AOI_IN15                   IMXRT_XBAR3(XBAR_OUTPUT, 31)    /* XBAR3_OUT31 -> AOI4  AOI_IN15 */

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_RT118X_IMXRT118X_XBAR_H */
